#Область ПрограммныйИнтерфейс

#Область Конструкторы

// Создает структуру схемы для построения модели состояния объекта
//
// Параметры:
//   Контекст - Произвольный, ФормаКлиентскогоПриложения - контекст объекта или форма
//   ПутьКДаннымОбъекта - Строка, Неопределено - используется если объект является частью контекста
//   МодульМодели - Строка - имя модуля модели с обработчиками состояния
//
// Возвращаемое значение:
//   Структура:
//     * Контекст - Произвольный, ФормаКлиентскогоПриложения - объект или основной реквизит формы
//     * Объект - Произвольный, ФормаКлиентскогоПриложения - объект или основной реквизит формы
//     * ПутьКДаннымОбъекта - Строка - путь к данным объекта, используется если объект является частью контекста
//     * Модуль - Строка - имя модуля модели
//     * ПараметрыСостояния - Соответствие из см. РаботаСМодельюСостояния.НовыйПараметр - словарь параметров
//     * Связи - Соответствие из см. РаботаСМодельюСостояния.НоваяСвязь - словать связей параметров по идентификатору
//     * ОбработчикИнициализацииДанных - Строка - обработчик инициализации
//     * ЗначенияПараметров - Массив из см. РаботаСМодельюСостояния.НовыйЗначениеПараметра
//     * ЭтоКонтекстФормы - Булево - признак контекста формы
//     * ЭлементыФормы - Соответствие из см. РаботаСМодельюСостояния.НовыйЭлементФормы - словарь элементов формы
//     * ПараметрыЭлементов - Соответствие из см. РаботаСМодельюСостояния.НовыйПараметрЭлементаФормы - словарь параметров элементов формы
//     * ИзмененныеПараметры - Массив из см. РаботаСМодельюОбъектаКлиентСервер.НовыйРасчетныйПараметр - 
Функция НоваяСхема(Контекст, Знач ПутьКДаннымОбъекта = Неопределено, МодульМодели = "") Экспорт
	Схема = Новый Структура;
	// Контекст
	Схема.Вставить("Контекст", Контекст);
	Схема.Вставить("Объект", Контекст);
	Схема.Вставить("ПутьКДаннымОбъекта", "");
	// Параметры состояния
	Схема.Вставить("Модуль", МодульМодели);
	Схема.Вставить("ПараметрыСостояния", Новый Соответствие);
	Схема.Вставить("Связи", Новый Соответствие);
	// Обработчики
	Схема.Вставить("ОбработчикИнициализацииДанных", "");
	// Значения параметров
	Схема.Вставить("ЗначенияПараметров", Новый Массив);
	Схема.Вставить("ИзмененныеПараметры", Новый Массив);
	// Элементы формы
	Схема.Вставить("ЭтоКонтекстФормы", Ложь);
	Схема.Вставить("ЭлементыФормы", Новый Соответствие);
	Схема.Вставить("ПараметрыЭлементов", Новый Соответствие);
	
	ЭтоКонтекстФормы = ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения");
	Схема.ЭтоКонтекстФормы = ЭтоКонтекстФормы;

	Если ЭтоКонтекстФормы И ПутьКДаннымОбъекта = Неопределено Тогда
		ПутьКДаннымОбъекта = "Объект";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКДаннымОбъекта) Тогда
		Схема.Объект = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Контекст, ПутьКДаннымОбъекта);
		Схема.ПутьКДаннымОбъекта = ПутьКДаннымОбъекта;
	КонецЕсли;
	
	Возврат Схема;
КонецФункции

#КонецОбласти

#КонецОбласти
