#Область ПрограммныйИнтерфейс

// Применить модель к контексту
// 
// Параметры:
//  Контекст - ОбъектМетаданных
Процедура ПрименитьМодель(Контекст) Экспорт
	Модель = РаботаСМодельюОбъектаКлиентСервер.НоваяМодельОбъекта(Контекст);
	РаботаСМодельюОбъектаКлиентСервер.ОпределитьПорядокПараметров(Модель);
	РаботаСМодельюОбъектаКлиентСервер.Рассчитать(Модель);
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		РаботаСМодельюФормы.НастроитьПараметрыВыбора(Контекст);
		РаботаСМодельюФормыКлиентСервер.ОбновитьФорму(Контекст);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьЗначениеСсылочногоТипа(СсылкаНаЗначение, Параметры, ЗаполнятьПоУмолчанию, Отказ) Экспорт
	
	Перем Значение;
	
	Если Параметры.Свойство("Ссылка", Значение) ИЛИ НЕ ЗначениеЗаполнено(Параметры) Тогда
		Возврат Значение;
	КонецЕсли;
	
	//  Проверка соответствия значения структуре параметров
	Значение = СсылкаНаЗначение;
	ПолноеИмя = СсылкаНаЗначение.Метаданные().ПолноеИмя();
	МодельЗапроса = РаботаСДаннымиВыбора.МодельЗапросаОбъектаДанныхВыбора(ПолноеИмя, Параметры, "Ссылка");
	
	Если ЗначениеЗаполнено(СсылкаНаЗначение) Тогда
		
		МодельЗапроса.Первые(1);
		МодельЗапроса.Параметр("ТекущееЗначение", СсылкаНаЗначение);
		ОператорВыбрать = МодельЗапроса.ОператорВыбрать;
		ОператорВыбрать.Отбор.Добавить("Источник.Ссылка = &ТекущееЗначение");
		
		Если МодельЗапроса.ВыполнитьЗапрос(Ложь).Результат().Пустой() Тогда
			Значение = Новый (ТипЗнч(Значение));
		КонецЕсли;
		
		ОператорВыбрать.Отбор.Удалить(ОператорВыбрать.Отбор.Количество() - 1);
		
	КонецЕсли;
	
	//  Заполнение пустого или сброшенного значения однозначным значением
	Если ЗаполнятьПоУмолчанию И НЕ ЗначениеЗаполнено(Значение) Тогда
		МодельЗапроса.Первые(2);
		Выборка = МодельЗапроса.ВыполнитьЗапрос().ВыбратьРезультат();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Значение = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура ЗаполнитьИРассчитать(ЭтотОбъект, Шаблон) Экспорт
	
	ИзмененныеПараметры = РаботаСМодельюОбъектаКлиентСервер.Заполнить(ЭтотОбъект, Шаблон);
	РаботаСМодельюОбъектаКлиентСервер.Рассчитать(ЭтотОбъект, ИзмененныеПараметры);
	
КонецПроцедуры

#КонецОбласти

