#Область ПрограммныйИнтерфейс

#Область Конструкторы

// Создает модель состояния для работы через DSL
//
// Параметры:
//   Контекст - Произвольный, ФормаКлиентскогоПриложения - контекст объекта или форма
//   ПутьКДаннымОбъекта - Строка - используется если объект является частью контекста
//   МодульМодели - Строка - имя модуля модели с обработчиками состояния
//
// Возвращаемое значение:
//   ОбработкаОбъект.МодельСостояния - созданная и настроенная модель состояния
Функция НоваяМодельСостояния(Контекст, ПутьКДаннымОбъекта = Неопределено, МодульМодели = "Контекст") Экспорт
	Возврат Обработки.МодельСостояния
		.Создать()
		.УстановитьСхему(Контекст, ПутьКДаннымОбъекта, МодульМодели)
	;
КонецФункции

// см. РаботаСМодельюСостоянияКлиентСервер.НоваяСхема
Функция НоваяСхема(Контекст, Знач ПутьКДаннымОбъекта = Неопределено, МодульМодели = "") Экспорт
	Схема = РаботаСМодельюСостоянияКлиентСервер.НоваяСхема(Контекст, ПутьКДаннымОбъекта, МодульМодели);
	Возврат Схема;
КонецФункции

// Создает новый параметр модели состояния с заданным именем и настройками по умолчанию
//
// Параметры:
//   ИмяПараметра - Строка
//   Вычисляемый - Булево - значение параметра не хранится. Используется для параметров, которые не сериализуются
//
// Возвращаемое значение:
//   Структура:
//     * Имя - Строка
//     * Контекстный - Булево - признак хранения непосредственно в контексте или в объекте
//     * Вычисляемый - Булево - значение параметра не хранится. Используется для параметров, которые не сериализуются
//     * ПутьКДанным - Строка - путь к данным в контексте или в объекте
//     * Тип - ОписаниеТипов, Неопределено - 
//     * ЭтоТаблица - Булево - признак табличной части
//     * ПроверкаЗначения - Булево - признак необходимости проверки заполненного значения
//     * Использование - Булево - признак использования параметра
//     * ПроверкаЗаполнения - Булево - признак необходимости проверки заполнения
//     * ЗаполнениеПоУмолчанию - Булево - признак заполнения по умолчанию
//     * ПараметрИспользование - Неопределено, Структура - см. НовыйПараметр
//     * ПараметрПроверкаЗаполнения - Неопределено, Структура - см. НовыйПараметр
//     * ПараметрЗаполнениеПоУмолчанию - Неопределено, Структура - см. НовыйПараметр
//     * НаКлиенте - Булево - признак контекста исполнения обработчиков состояния
//     * Выражение - Строка - выражение для вычисления значения параметра
//     * ОбработчикПриИзменении - Строка - имя функции обработчика события при изменении
//     * ВходящиеСвязи - Массив из Строка - идентификаторы входящих связей
//     * ИсходящиеСвязи - Массив из Строка - идентификаторы исходящих связей
//     * ПараметрТаблица - Неопределено, Структура - см. НовыйПараметр
//     * Ключ - Строка, Неопределено - Имена полей через запятую, которые составляют ключ строки таблицы,
//                                     где параметр состояния - это таблица
//     * ПараметрОтборСтрок - Неопределено - параметр отбора строк
//     * ПараметрыКолонок - Неопределено - параметры колонок
//     * ЗависимыеЭлементы - Массив из Строка - идентификаторы из см. РаботаСМодельюСостояния.НовыйПараметрЭлементаФормы
//     * Элементы - Массив из Строка - имена элементов формы, параметры которых влияют на параметр
//     * ЭлементыСвязей - Массив из Строка - имена элементов формы, зависимые от параметра
//     * ИндексЗначения - Неопределено, Число - индекс значения в массиве Схема.ЗначенияПараметров
//     * Порядок - Неопределено, Число - порядок параметра в топографическом графе зависимостей
Функция НовыйПараметр(ИмяПараметра, Вычисляемый = Ложь) Экспорт
	Параметр = Новый Структура;
	//  Основные
	Параметр.Вставить("Имя", "");
	Параметр.Вставить("Контекстный", Ложь);
	Параметр.Вставить("Вычисляемый", Ложь);
	Параметр.Вставить("ПутьКДанным", "");
	Параметр.Вставить("Тип", Неопределено);
	Параметр.Вставить("ЭтоТаблица", Ложь);
	//  Реквизиты: Характеристики
	Параметр.Вставить("ПроверкаЗначения", Ложь);
	Параметр.Вставить("Использование", Истина);
	Параметр.Вставить("ПроверкаЗаполнения", Истина);
	Параметр.Вставить("ЗаполнениеПоУмолчанию", Истина);
	//  Реквизиты: Таблица
	Параметр.Вставить("ПараметрТаблица", Неопределено);
	Параметр.Вставить("ПараметрОтборСтрок", Неопределено);
	Параметр.Вставить("ПараметрыКолонок", Неопределено);
	Параметр.Вставить("Ключ", Неопределено);
	//  Реквизиты: Параметризированные Характеристики	
	Параметр.Вставить("ПараметрИспользование", Неопределено);
	Параметр.Вставить("ПараметрПроверкаЗаполнения", Неопределено);
	Параметр.Вставить("ПараметрЗаполнениеПоУмолчанию", Неопределено);
	//  Обработчики
	Параметр.Вставить("НаКлиенте", Ложь);
	Параметр.Вставить("Выражение", "");
	Параметр.Вставить("ОбработчикПриИзменении", "");
	//  Связи
	Параметр.Вставить("ВходящиеСвязи", Новый Массив);
	Параметр.Вставить("ИсходящиеСвязи", Новый Массив);
	Параметр.Вставить("ЗависимыеЭлементы", Новый Массив);
	Параметр.Вставить("Элементы", Новый Массив);
	Параметр.Вставить("ЭлементыСвязей", Новый Массив);
	//
	Параметр.Вставить("ИндексЗначения", Неопределено);
	Параметр.Вставить("Порядок", Неопределено);
	//
	Параметр.Имя = ИмяПараметра;
	Параметр.Вычисляемый = Вычисляемый;
	Возврат Параметр;
КонецФункции

// Создает новый элемент формы
//
// Параметры:
//   ИмяЭлемента - Строка - имя элемента формы
//
// Возвращаемое значение:
//   Структура:
//     * Имя - Строка - имя элемента формы
//     * Параметр - Неопределено, Структура - см. НовыйПараметр
//     * Таблица - Неопределено - связанная таблица
//     * ПараметрТекущаяСтрока - Неопределено - параметр текущей строки
//     * ЭтоГруппа - Булево - признак группы элементов
//     * ЭтоТаблица - Булево - признак таблицы
//     * ЭтоПолеВвода - Булево - признак поля ввода
//     * НаКлиенте - Булево - признак использования на клиенте
//     * ФункцияСостояния - Строка - функция состояния элемента
//     * Параметры - Массив из Строка - идентификаторы параметров элементов формы из Схема.ПараметрыЭлементов
//     * Свойства - Массив из Строка - идентификаторы параметров элементов формы из Схема.ПараметрыЭлементов
//     * Порядок - Число - порядок элемента
//     * Элементы - Массив из Строка - вложенные элементы формы
Функция НовыйЭлементФормы(ИмяЭлемента) Экспорт
	ЭлементФормы = Новый Структура;
	//  Измерения
	ЭлементФормы.Вставить("Имя", "");
	//  Реквизиты
	ЭлементФормы.Вставить("Параметр", Неопределено);
	ЭлементФормы.Вставить("Таблица", Неопределено);
	ЭлементФормы.Вставить("ПараметрТекущаяСтрока", Неопределено);
	ЭлементФормы.Вставить("НаКлиенте", Истина);
	ЭлементФормы.Вставить("ЭтоГруппа", Ложь);
	ЭлементФормы.Вставить("ЭтоТаблица", Ложь);
	ЭлементФормы.Вставить("ЭтоПолеВвода", Ложь);
	ЭлементФормы.Вставить("ФункцияСостояния", "");
	ЭлементФормы.Вставить("Порядок", 0);
	//  Связанные данные
	ЭлементФормы.Вставить("Параметры", Новый Массив);//  ЭлементФормы -> ПараметрыЭлементов.Элемент
	ЭлементФормы.Вставить("Свойства", Новый Массив);//  ЭлементФормы -> ПараметрыЭлементов.Элемент
	ЭлементФормы.Вставить("Элементы", Новый Массив);//  ЭлементыФормы[]
	//
	ЭлементФормы.Имя = ИмяЭлемента;
	Возврат ЭлементФормы;
КонецФункции

// Создает структуру с параметрами элемента формы для модели состояния.
//
// Параметры:
//   Элемент - см. НовыйЭлементФормы
//   Параметр - см. НовыйПараметр
//   Свойство - Строка - имя свойства элемента формы
//   ПутьКДанным - Строка - путь к данным элемента формы. Если не указан, используется имя параметра
//
// Возвращаемое значение:
//   Структура:
//     * Идентификатор - Строка - идентификатор параметра элемента формы
//     * Элемент - см. НовыйЭлементФормы
//     * Параметр - см. НовыйПараметр
//     * Свойство - Строка - значение свойства элемента
//     * Тип - Неопределено, ОписаниеТипов - тип параметра элемента формы
//     * ПутьКДанным - Строка - путь к данным элемента формы
//     * ПараметрИспользование - Неопределено - параметр использования элемента
Функция НовыйПараметрЭлементаФормы(Элемент, Параметр, Свойство = "", ПутьКДанным = "") Экспорт
	ИдентификаторПараметраЭлемента = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
	ПараметрЭлементаФормы = Новый Структура;
	ПараметрЭлементаФормы.Вставить("Идентификатор", ИдентификаторПараметраЭлемента);
	//  Измерения
	ПараметрЭлементаФормы.Вставить("Элемент", Элемент);
	ПараметрЭлементаФормы.Вставить("Параметр", Параметр);
	ПараметрЭлементаФормы.Вставить("Свойство", "");
	ПараметрЭлементаФормы.Вставить("Тип", Неопределено);
	//  Реквизиты
	ПараметрЭлементаФормы.Вставить("ПутьКДанным", ?(НЕ ЗначениеЗаполнено(ПутьКДанным), Параметр.Имя, ПутьКДанным));
	ПараметрЭлементаФормы.Вставить("ПараметрИспользование", Неопределено);
	//
	ПараметрЭлементаФормы.Свойство = Свойство;
	Возврат ПараметрЭлементаФормы;
КонецФункции

// Создает новую связь между параметром состояния и параметром.
//
// Параметры:
//   ПараметрСостояния - Структура - параметр, для которого описывается связь. См. НовыйПараметр 
//   Параметр - Структура - входящий параметр, определяющий значение параметра состояния. См. НовыйПараметр
//   ПутьКДанным - Строка - путь к данным параметра. Имеет смысл, только если параметр влияет на значение параметра состояния.
//                          Если прямого влияния нету, например, параметр Использование, то путь к данным остается пустым
//   Значение - Произвольный - значение связи, используется, если параметр не заполнен.
//                            Такая связь нужна для декларативного описания параметров в ПараметрыВыбора
//   ПроверкаЗаполнения - Булево - связь работает только, если значение связи заполнено. При этом
//                                 значение связи получается из значения параметра или из значения
//
// Возвращаемое значение:
//   Структура:
//     * Идентификатор - Строка - уникальный идентификатор связи
//     * ПараметрСостояния - см. НовыйПараметр
//     * Параметр - Неопределено - см. НовыйПараметр
//     * ПутьКДанным - Строка - путь к данным
//     * Значение - Произвольный, Неопределено - значение связи
//     * ПараметрИспользование - Неопределено - параметр использования
//     * ПроверкаЗаполнения - Булево - проверка заполнения
//     * Слабая - Булево - признак слабой связи
//@skip-check method-too-many-params
Функция НоваяСвязь(ПараметрСостояния, Параметр = Неопределено, ПутьКДанным = "", Значение = Неопределено, ПроверкаЗаполнения = Ложь) Экспорт
	Идентификатор = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
	Связь = Новый Структура;
	Связь.Вставить("Идентификатор", Идентификатор);
	//  Измерения
	Связь.Вставить("ПараметрСостояния", ПараметрСостояния);
	Связь.Вставить("Параметр", Неопределено);
	//  Реквизиты
	Связь.Вставить("ПутьКДанным", ПутьКДанным);
	Связь.Вставить("Значение", Значение);
	Связь.Вставить("ПараметрИспользование", Неопределено);
	Связь.Вставить("ПроверкаЗаполнения", Ложь);
	Связь.Вставить("Слабая", Ложь);
	//
	Связь.ПроверкаЗаполнения = ПроверкаЗаполнения;
	Связь.Параметр = Параметр;
	
	Возврат Связь;	
КонецФункции

// Новое значение параметра.
// 
// Параметры:
//  Параметр - см. НовыйПараметр
//  Значение - Произвольный, Неопределено - Значение параметра
// 
// Возвращаемое значение:
//  Структура - Новое значение параметра:
// * Параметр - см. НовыйПараметр 
// * Значение - Произвольный, Неопределено - Значение параметра
Функция НовыйЗначениеПараметра(Параметр, Значение = Неопределено) Экспорт
	ЗначениеПараметра = Новый Структура;
	ЗначениеПараметра.Вставить("Параметр", Параметр);
	ЗначениеПараметра.Вставить("Значение", Значение);
	Возврат ЗначениеПараметра;	
КонецФункции

#КонецОбласти

#Область ПоискЭлементовСхемыСостояния

// Возвращает существующий параметр состояния из схемы или создает новый с указанными свойствами.
//
// Параметры:
//   Схема - см. НоваяСхема
//   Путь - Строка - путь к данным объекта или контекста. Если не указан, используется GUID
//   Имя - Строка - имя параметра состояния. Если не указан, используется путь к данным
//   Контекстный - Булево - признак принадлежности параметра контексту. Если не указан, определяется автоматически по пути
//   Тип - ОписаниеТипов, Неопределено - тип значения параметра. Может быть строкой с типами, массивом типов или описанием типов
//   Вычисляемый - Булево - признак вычисляемого параметра
//
// Возвращаемое значение:
//   см. НовыйПараметр
//@skip-check method-too-many-params
Функция ПараметрСостояния(Схема, Путь = "", Имя = "", Контекстный = Неопределено, Тип = Неопределено, Вычисляемый = Ложь) Экспорт
	ПутьКДанным = ?(ЗначениеЗаполнено(Путь), Путь, ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору());
	ИмяПараметра = ОбщийКлиентСервер.ЕстьПустоеЗначение(Имя, ПутьКДанным);
	ПараметрСостояния = Схема.ПараметрыСостояния[ИмяПараметра];
	Если ЗначениеЗаполнено(ПараметрСостояния) Тогда
		Если Контекстный <> Неопределено Тогда
			ПараметрСостояния.Контекстный = Контекстный;
		КонецЕсли;
		Если Тип <> Неопределено Тогда
			Если ТипЗнч(Тип) = Тип("Строка") Тогда
				ПараметрСостояния.Тип = Новый ОписаниеТипов(Тип);
			Иначе
				ПараметрСостояния.Тип = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип));			 
			КонецЕсли;
			Если Тип = Новый ОписаниеТипов("Булево") Тогда
				ПараметрСостояния.ПроверкаЗаполнения = Ложь;
			КонецЕсли;
		КонецЕсли;
		//@skip-check constructor-function-return-section
		Возврат ПараметрСостояния;
	КонецЕсли;
	ПараметрСостояния = ДобавитьПараметр(Схема, ИмяПараметра, Вычисляемый);
	Схема.ПараметрыСостояния[ИмяПараметра] = ПараметрСостояния;
	//  Путь, Контекстный
	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		СоставПути = СтрРазделить(ПутьКДанным, ".");
		ПутьКДаннымБазовогоПараметра = СоставПути[0];
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Схема.Объект, ПутьКДаннымБазовогоПараметра) Тогда
			ЭтоКонтекст = Ложь;
			ЭтоРеквизитИлиСвойство = Истина;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Схема.Контекст, ПутьКДаннымБазовогоПараметра) Тогда
			ЭтоКонтекст = Истина;
			ЭтоРеквизитИлиСвойство = Истина;
		Иначе
			ЭтоКонтекст = Истина;
			ЭтоРеквизитИлиСвойство = Ложь;
		КонецЕсли;
	Иначе
		ЭтоКонтекст = Истина;
		ЭтоРеквизитИлиСвойство = Ложь;
	КонецЕсли;
	ПараметрСостояния.Контекстный = ЭтоКонтекст;
	Если ЭтоРеквизитИлиСвойство Тогда
		ПараметрСостояния.ПутьКДанным = ПутьКДанным;
		Если СоставПути.Количество() = 1 Тогда
			Если ЭтоКонтекст Тогда
				Значение = Схема.Контекст[ПутьКДаннымБазовогоПараметра];
				ТипЗначения = ТипЗнч(Значение);
			Иначе
				Значение = Схема.Объект[ПутьКДаннымБазовогоПараметра];
				ТипЗначения = ТипЗнч(Значение);
			КонецЕсли;
			
			Если ТипЗначения = Тип("ТаблицаЗначений") ИЛИ ТипЗначения = Тип("ДеревоЗначений") Тогда
				ПараметрСостояния.ЭтоТаблица = Истина;
				ПараметрСостояния.ПараметрыКолонок = ПараметрыКолонок(Схема, ПараметрСостояния, Значение.Колонки);
			ИначеЕсли ТипЗначения = Тип("ДанныеФормыКоллекция") Тогда
				ПараметрСостояния.ЭтоТаблица = Истина;
				ПараметрСостояния.ПараметрыКолонок = ПараметрыКолонок(Схема, ПараметрСостояния, Значение.Выгрузить(Новый Массив).Колонки, "ИсходныйНомерСтроки, НомерСтроки");
			ИначеЕсли ТипЗначения = Тип("ДанныеФормыДерево") Тогда
				ПараметрСостояния.ЭтоТаблица = Истина;
				//@skip-check using-form-data-to-value
				ПараметрСостояния.ПараметрыКолонок = ПараметрыКолонок(Схема, ПараметрСостояния, ДанныеФормыВЗначение(Значение, Тип("ДеревоЗначений")).Колонки);
			ИначеЕсли СтрНайти(ТипЗначения, "табличная часть") > 0 Тогда
				ПараметрСостояния.ЭтоТаблица = Истина;
				ПараметрСостояния.ПараметрыКолонок = ПараметрыКолонок(Схема, ПараметрСостояния, Значение.Выгрузить(Новый Массив).Колонки, "НомерСтроки");
			КонецЕсли;
			
		Иначе
			БазовыйПараметр = ПараметрСостояния(Схема, ПутьКДаннымБазовогоПараметра);
			Если БазовыйПараметр.ЭтоТаблица Тогда
				ПараметрСостояния.ПараметрТаблица = БазовыйПараметр;			
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли НЕ Вычисляемый Тогда
		Схема.ЗначенияПараметров.Добавить(НовыйЗначениеПараметра(ПараметрСостояния));
		ПараметрСостояния.ИндексЗначения = Схема.ЗначенияПараметров.Количество() - 1;
	КонецЕсли;
	Если Тип <> Неопределено Тогда
		Если ТипЗнч(Тип) = Тип("Строка") Тогда
			ПараметрСостояния.Тип = Новый ОписаниеТипов(Тип);
		Иначе
			ПараметрСостояния.Тип = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип));			 
		КонецЕсли;
	КонецЕсли;
	Если Тип = Новый ОписаниеТипов("Булево") Тогда
		ПараметрСостояния.ПроверкаЗаполнения = Ложь;
	КонецЕсли;
	Возврат ПараметрСостояния;
КонецФункции

// Добавляет новую связь или возвращает существующую.
//
// Параметры:
//   Схема - Структура - схема модели состояния - см. НоваяСхема
//   ПараметрСостояния - Структура - параметр состояния модели - см. НовыйПараметр
//   Параметр - Структура - параметр, для которого устанавливается связь - см. НовыйПараметр
//   ПутьКДанным - Строка - путь к данным, если не указан, то используется имя входящего параметра
//   Значение - Произвольный - значение параметра связи, для случая, когда входящий параметр не задан
//   ПроверкаЗаполнения - Булево - правила проверки заполнения
//
// Возвращаемое значение:
//   см. НоваяСвязь
//@skip-check method-too-many-params
Функция Связь(Схема, ПараметрСостояния, Параметр = Неопределено, Знач ПутьКДанным = "", Значение = Неопределено, ПроверкаЗаполнения = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Параметр) И НЕ ЗначениеЗаполнено(ПутьКДанным) Тогда
		ПутьКДанным = Параметр.Имя;
	КонецЕсли;
	Возврат ДобавитьСвязь(Схема, ПараметрСостояния, Параметр, ПутьКДанным, Значение, ПроверкаЗаполнения);
КонецФункции

// Возвращает элемент формы модели состояния по имени или объекту элемента формы, создавая его при необходимости и настраивая параметры
//
// Параметры:
//   Схема - см. НоваяСхема
//   ЭлементИлиИмя - Строка, ФормаКлиентскогоПриложения, Произвольный - имя элемента формы, по умолчанию "ЭтаФорма"
//                                                                      или сам объект формы или элемент формы (ТаблицаФормы, ПолеФормы и т.д.)
//
// Возвращаемое значение:
//   см. НовыйЭлементФормы
Функция ЭлементФормы(Схема, ЭлементИлиИмя = "ЭтаФорма") Экспорт
	//  Определить ИмяЭлемента (ИмяЭлемента|ЭтаФорма), Элемент (Элемент|ЭтаФорма)
	Если ТипЗнч(ЭлементИлиИмя) = Тип("Строка") Тогда
		ИмяЭлемента = ЭлементИлиИмя;
		Если ЭлементИлиИмя = "ЭтаФорма" Тогда
			Элемент = Схема.Контекст;
		Иначе
			Элемент = Схема.Контекст.Элементы.Найти(ИмяЭлемента);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭлементИлиИмя) = Тип("ФормаКлиентскогоПриложения") Тогда
		ИмяЭлемента = "ЭтаФорма";
		Элемент = Схема.Контекст;
	Иначе
		ИмяЭлемента = ЭлементИлиИмя.Имя;
		Элемент = Схема.Контекст.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	//  Создание элемента формы модели состояния
	ЭлементФормы = Схема.ЭлементыФормы[ИмяЭлемента];
	Если ЗначениеЗаполнено(ЭлементФормы) Тогда
		//@skip-check constructor-function-return-section
		Возврат ЭлементФормы;
	КонецЕсли;
	ЭлементФормы = ДобавитьЭлементФормы(Схема, ИмяЭлемента);
	Если ИмяЭлемента = "ЭтаФорма" Тогда
		Возврат ЭлементФормы;
	КонецЕсли;
	//  Донастройка элемента формы модели состояния: ЭтоТаблица, ЭтоПолеВвода, Параметр
	ТипЭлемента = ТипЗнч(Элемент);
	ПутьКДанным = "";
	Если ТипЭлемента = Тип("ТаблицаФормы") Тогда
		ЭлементФормы.ЭтоТаблица = Истина;
		ПутьКДанным = Элемент.ПутьКДанным;
	ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда // И Элемент.Вид = ВидПоляФормы.ПолеВвода
		ЭлементФормы.ЭтоПолеВвода = Истина;
		ПутьКДанным = Элемент.ПутьКДанным;
	КонецЕсли;
	Если СтрНачинаетсяС(ПутьКДанным, "Элементы") Тогда
		//Элементы(0).ЭлементТаблицы(1).ТекущиеДанные(2).Реквизит(3) - так можно выводить поля формы, которые ссылаются на текущие данные в таблице
		Состав = СтрРазделить(ПутьКДанным, ".");
		ЭлементФормы.Таблица = Состав[1];
		ПутьКДанным = Схема.Контекст.Элементы[ЭлементФормы.Таблица].ПутьКДанным + "." + Состав[3];
	КонецЕсли;
	Если СтрНачинаетсяС(ПутьКДанным, Схема.ПутьКДаннымОбъекта) Тогда
		ПутьКДанным = Прав(ПутьКДанным, СтрДлина(ПутьКДанным) - СтрДлина(Схема.ПутьКДаннымОбъекта) - 1);
	КонецЕсли;
	//  Заполнение параметра элемента
	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		ПараметрЭлемента = ПараметрСостояния(Схема, ПутьКДанным);
		ПараметрЭлемента.Элементы.Добавить(ЭлементФормы.Имя);
		ЭлементФормы.Параметр = ПараметрЭлемента;
		//  Добавить зависимость по параметрам связей
		Если ЗначениеЗаполнено(ПараметрЭлемента.ПараметрИспользование) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрЭлемента.ПараметрИспользование.ЭлементыСвязей, ПараметрЭлемента.Элементы, Истина);
		КонецЕсли;
		Для Каждого ИдентификаторСвязи Из ПараметрЭлемента.ВходящиеСвязи Цикл
			Связь = Схема.Связи[ИдентификаторСвязи];
			Если ЗначениеЗаполнено(Связь.Параметр.ПараметрИспользование) Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Связь.Параметр.ПараметрИспользование.ЭлементыСвязей, ПараметрЭлемента.Элементы, Истина);
			КонецЕсли;
			Если ЗначениеЗаполнено(Связь.ПараметрИспользование) Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Связь.ПараметрИспользование.ЭлементыСвязей, ПараметрЭлемента.Элементы, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ЭлементФормы;
КонецФункции

#КонецОбласти

#Область НастройкаЭлементовФормы

// Установить действие.
// 
// Параметры:
//  Элемент - ФормаКлиентскогоПриложения, Произвольный - Форма или Элемент формы 
//  ИмяСобытия - Строка - Имя события обработчика элемента формы
//  Действие - Строка - Имя процедуры обработчика
Процедура УстановитьДействие(Элемент, ИмяСобытия, Действие) Экспорт
	Если НЕ ЗначениеЗаполнено(Элемент.ПолучитьДействие(ИмяСобытия)) Тогда
		Элемент.УстановитьДействие(ИмяСобытия, Действие);
	КонецЕсли;
КонецПроцедуры

// Добавить элементы формы в схему модели состояния.
// При добавлении элементов в модель состояния также устанавливает обработчики.
// 
// Параметры:
//  Схема - см. НоваяСхема
Процедура ДобавитьЭлементыФормы(Схема) Экспорт
	УстановитьДействие(Схема.Контекст, "ПриОткрытии", "ПриОткрытииВМоделиФормы");
	Для Каждого Элемент Из Схема.Контекст.Элементы Цикл
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента = Тип("ТаблицаФормы") ИЛИ ТипЭлемента = Тип("ПолеФормы") Тогда
			ЭлементФормы = ЭлементФормы(Схема, Элемент.Имя);
			Если ТипЭлемента = Тип("ТаблицаФормы") Тогда
				ЭлементФормы.ЭтоТаблица = Истина;
				УстановитьДействие(Элемент, "ПриАктивизацииСтроки", "ПриАктивизацииСтрокиТаблицыФормы");
				Для Каждого ПодчиненныйЭлемент Из РаботаСМодельюФормыКлиентСервер.НайтиПодчиненныеЭлементы(Элемент) Цикл
					ЭлементТаблицы = ЭлементФормы(Схема, ПодчиненныйЭлемент.Имя);
					ЭлементТаблицы.Таблица = Элемент.Имя;					
				КонецЦикла;
				УстановитьДействие(Элемент, "ПередНачаломДобавления", "ПередНачаломДобавленияСтрокиТаблицыФормы");
				УстановитьДействие(Элемент, "ПередНачаломИзменения", "ПередНачаломИзмененияСтрокиТаблицыФормы");
				УстановитьДействие(Элемент, "ПередОкончаниемРедактирования", "ПередОкончаниемРедактированияСтрокиТаблицыФормы");
				УстановитьДействие(Элемент, "ПередУдалением", "ПередУдалениемСтрокиТаблицыФормы");
				УстановитьДействие(Элемент, "ПриНачалеРедактирования", "ПриНачалеРедактированияСтрокиТаблицыФормы");
				УстановитьДействие(Элемент, "ПриОкончанииРедактирования", "ПриОкончанииРедактированияСтрокиТаблицыФормы");
				УстановитьДействие(Элемент, "Выбор", "ВыборСтрокиТаблицыФормы");
				Продолжить;
			ИначеЕсли ТипЭлемента = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
				УстановитьДействие(Элемент, "НачалоВыбора", "НачалоВыбора");
				ЭлементФормы.ЭтоПолеВвода = Истина;
			КонецЕсли;
			УстановитьДействие(Элемент, "ПриИзменении", "ПриИзменении");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСхемой

// Добавляет новый параметр в модель состояния и сохраняет его в схеме.
//
// Параметры:
//   Схема - см. НоваяСхема
//   ИмяПараметра - Строка - имя добавляемого параметра
//   Вычисляемый - Булево - признак того, что параметр является вычисляемым
//
// Возвращаемое значение:
//   см. НовыйПараметр
Функция ДобавитьПараметр(Схема, ИмяПараметра, Вычисляемый = Ложь) Экспорт
	Параметр = НовыйПараметр(ИмяПараметра, Вычисляемый);
	//  Связанные Данные
	Схема.ПараметрыСостояния[ИмяПараметра] = Параметр;
	Возврат Параметр;
КонецФункции

// Создает связь между параметрами состояния в модели и добавляет её в схему.
//
// Параметры:
//   Схема - см. НоваяСхема
//   ПараметрСостояния - см. НовыйПараметр
//   Параметр - см. НовыйПараметр
//   ПутьКДанным - Строка - путь к данным в объекте, разделенный точками
//   Значение - Произвольный - фиксированное значение для связи
//   ПроверкаЗаполнения - Булево - параметры проверки заполнения
//
// Возвращаемое значение:
//   см. НоваяСвязь
//@skip-check method-too-many-params
Функция ДобавитьСвязь(Схема, ПараметрСостояния, Параметр = Неопределено, ПутьКДанным = "", Значение = Неопределено, ПроверкаЗаполнения = Неопределено) Экспорт
	Связь = НоваяСвязь(ПараметрСостояния, Параметр, ПутьКДанным, Значение, ПроверкаЗаполнения);
	//  Связанные Данные
	Схема.Связи[Связь.Идентификатор] = Связь;
	ПараметрСостояния.ВходящиеСвязи.Добавить(Связь.Идентификатор);
	Если ЗначениеЗаполнено(Параметр) Тогда
		Параметр.ИсходящиеСвязи.Добавить(Связь.Идентификатор);
	КонецЕсли;
	Возврат Связь;
КонецФункции

// Создает новый элемент формы с указанным именем и добавляет его в схему модели состояния.
//
// Параметры:
//   Схема - см. НоваяСхема
//   ИмяЭлемента - Строка - имя элемента формы
//
// Возвращаемое значение:
//   см. НовыйЭлементФормы
Функция ДобавитьЭлементФормы(Схема, ИмяЭлемента) Экспорт
	ЭлементФормы = НовыйЭлементФормы(ИмяЭлемента);
	Схема.ЭлементыФормы[ИмяЭлемента] = ЭлементФормы;
	Возврат ЭлементФормы;
КонецФункции

// Создает и добавляет параметр элемента формы в модель состояния, устанавливая зависимости и параметры связывания
//
// Параметры:
//   Схема - см. НоваяСхема
//   Элемент - см. НовыйЭлементФормы
//   Параметр - см. НовыйПараметр
//   Свойство - Строка, Неопределено - имя свойства элемента формы для связывания с параметром. 
//                                    Если заполнено, параметр добавляется в свойства, иначе в параметры
//   ПутьКДанным - Строка - путь к данным элемента формы
//
// Возвращаемое значение:
//   см. НовыйПараметрЭлементаФормы
Функция ДобавитьПараметрЭлементаФормы(Схема, Элемент, Параметр, Свойство = Неопределено, ПутьКДанным = "") Экспорт
	ПараметрЭлемента = НовыйПараметрЭлементаФормы(Элемент, Параметр, Свойство, ПутьКДанным);
	//  Связанные Данные
	Схема.ПараметрыЭлементов[ПараметрЭлемента.Идентификатор] = ПараметрЭлемента;
	Если ЗначениеЗаполнено(Свойство) Тогда
		Элемент.Свойства.Добавить(ПараметрЭлемента.Идентификатор);
	Иначе
		Элемент.Параметры.Добавить(ПараметрЭлемента.Идентификатор);
	КонецЕсли;
	Параметр.ЗависимыеЭлементы.Добавить(ПараметрЭлемента.Идентификатор);
	Возврат ПараметрЭлемента;
КонецФункции

// Определить порядок параметров согласно топографической сортировке.
// 
// Параметры:
//  Схема - см. НоваяСхема
Процедура ОпределитьПорядок(Схема) Экспорт
	Порядок = 0;
	Для Каждого КлючЗначение Из Схема.ПараметрыСостояния Цикл
		ПараметрСостояния = КлючЗначение.Значение;
		Если ЗначениеЗаполнено(ПараметрСостояния.Порядок) Тогда
			Продолжить;
		КонецЕсли;
		Порядок = ПорядокПараметра(Схема, ПараметрСостояния, Порядок) + 1;
		ПараметрСостояния.Порядок = Порядок;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Применить модель объекта.
// 
// Параметры:
//  Схема - см. НоваяСхема
Процедура ПрименитьМодельОбъекта(Схема) Экспорт
	МодельТаблицы = Общий.МодельТаблицы();
	МодельТаблицы.Таблица("ЗначенияПараметров")
		.Колонка("Параметр").ТипСтрока(255)
		.Колонка("Значение").ТипПроизвольный()
	;
	Контекст = Схема.Контекст;
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ЗначенияПараметров") Тогда
			НовыеРеквизиты = Новый Массив;
			//  Контекст Модели
			НовыеРеквизиты.Добавить(Новый РеквизитФормы("ПутьКДаннымОбъекта", ОбщегоНазначения.ОписаниеТипаСтрока(50)));
			НовыеРеквизиты.Добавить(Новый РеквизитФормы("МодульМодели", ОбщегоНазначения.ОписаниеТипаСтрока(150)));
			//  Контекст Объекта
			НовыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыСостояния", Новый ОписаниеТипов));
			НовыеРеквизиты.Добавить(Новый РеквизитФормы("Связи", Новый ОписаниеТипов));
			//  Контекст Формы
			НовыеРеквизиты.Добавить(Новый РеквизитФормы("ЭлементыФормы", Новый ОписаниеТипов));
			НовыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыЭлементов", Новый ОписаниеТипов));
			МодельТаблицы.СоздатьТаблицыВРеквизитахФормы(НовыеРеквизиты);
			Контекст.ИзменитьРеквизиты(НовыеРеквизиты);
		КонецЕсли;
		//  Контекст Модели
		Контекст.ПутьКДаннымОбъекта = Схема.ПутьКДаннымОбъекта;
		Контекст.МодульМодели = Схема.Модуль;
		//  Контекст Объекта
		Контекст.ПараметрыСостояния = Новый ФиксированноеСоответствие(Схема.ПараметрыСостояния);
		Контекст.Связи = Новый ФиксированноеСоответствие(Схема.Связи);
		//  Контекст Формы
		Контекст.ЭлементыФормы = Новый ФиксированноеСоответствие(Схема.ЭлементыФормы);
		Контекст.ПараметрыЭлементов = Новый ФиксированноеСоответствие(Схема.ПараметрыЭлементов);
		//
		Контекст.ЗначенияПараметров.Очистить();
		Для Каждого ЭлементЗначенияПараметра Из Схема.ЗначенияПараметров Цикл
			ЗначениеПараметра = Контекст.ЗначенияПараметров.Добавить();
			ЗначениеПараметра.Параметр = ЭлементЗначенияПараметра.Параметр.Имя;
			ЗначениеПараметра.Значение = ЭлементЗначенияПараметра.Значение;
		КонецЦикла;
	Иначе
		ДополнительныеСвойства = Контекст.ДополнительныеСвойства;
		МодельТаблицы.СоздатьТаблицыВСтруктуре(ДополнительныеСвойства);
		//  Контекст Модели
		ДополнительныеСвойства.Вставить("ПутьКДаннымОбъекта", Схема.ПутьКДаннымОбъекта);
		ДополнительныеСвойства.Вставить("МодульМодели", Схема.Модуль);
		//  Контекст Объекта
		ДополнительныеСвойства.Вставить("ПараметрыСостояния", Схема.ПараметрыСостояния);
		ДополнительныеСвойства.Вставить("Связи", Схема.Связи);
		//
		Для Каждого ЭлементЗначенияПараметра Из Схема.ЗначенияПараметров Цикл
			ЗначениеПараметра = ДополнительныеСвойства.ЗначенияПараметров.Добавить();
			ЗначениеПараметра.Параметр = ЭлементЗначенияПараметра.Параметр.Имя;
			ЗначениеПараметра.Значение = ЭлементЗначенияПараметра.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыКолонок(Схема, ПараметрТаблицы, Колонки, ИсключитьКолонки = "")
	КолонкиИПараметры = Новый Структура;
	Исключения = ОбщийКлиентСервер.Массив(ИсключитьКолонки);
	Для Каждого Колонка Из Колонки Цикл
		Если Исключения.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПутьКДанным = ПараметрТаблицы.ПутьКДанным + "." + Колонка.Имя;				
		Параметр = ПараметрСостояния(Схема, ПутьКДанным);
		КолонкиИПараметры.Вставить(Колонка.Имя, Параметр.Имя);		
	КонецЦикла;
	Возврат КолонкиИПараметры;
КонецФункции	

Функция ПорядокПараметра(Схема, Параметр, Знач Порядок)
	Перем ПараметрСостояния;
	Перем Связь;
	Для Каждого Связь Из Параметр.ИсходящиеСвязи Цикл
		ПараметрСостояния = Схема.Связи[Связь].ПараметрСостояния;		
		Если ЗначениеЗаполнено(ПараметрСостояния.Порядок) Тогда
			Порядок = Макс(Порядок, ПараметрСостояния.Порядок);
			Продолжить;
		КонецЕсли;
		Порядок = ПорядокПараметра(Схема, ПараметрСостояния, Порядок) + 1;
		ПараметрСостояния.Порядок = Порядок;
	КонецЦикла;
	Возврат Порядок;
КонецФункции

#КонецОбласти
