#Область ПрограммныйИнтерфейс

#Область Конструкторы

// Создает модель объекта на основе переданного контекста.
//
// Параметры:
//   Контекст - Произвольный - объект или форма клиентского приложения
//
// Возвращаемое значение:
//   см. РаботаСМодельюСостоянияКлиентСервер.НоваяСхема
Функция НоваяМодельОбъекта(Контекст) Экспорт
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		МодельОбъекта = РаботаСМодельюСостоянияКлиентСервер.НоваяСхема(Контекст, Контекст.ПутьКДаннымОбъекта, Контекст.МодульМодели);
		//
		МодельОбъекта.ПараметрыСостояния = Контекст.ПараметрыСостояния;
		МодельОбъекта.Связи = Контекст.Связи;
		МодельОбъекта.ЗначенияПараметров = Контекст.ЗначенияПараметров;
		//
		МодельОбъекта.ЭлементыФормы = Контекст.ЭлементыФормы;
		МодельОбъекта.ПараметрыЭлементов = Контекст.ПараметрыЭлементов;
		
	Иначе
		
		ДополнительныеСвойства = Контекст.ДополнительныеСвойства;
		МодельОбъекта = РаботаСМодельюСостоянияКлиентСервер.НоваяСхема(Контекст, "", ДополнительныеСвойства.МодульМодели);
		//
		МодельОбъекта.ПараметрыСостояния = ДополнительныеСвойства.ПараметрыСостояния;
		МодельОбъекта.Связи = ДополнительныеСвойства.Связи;
		МодельОбъекта.ЗначенияПараметров = ДополнительныеСвойства.ЗначенияПараметров;
		
	КонецЕсли;

	Возврат МодельОбъекта;
	
КонецФункции

// Новый расчетный параметр.
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
//  Параметр - см. РаботаСМодельюСостояния.НовыйПараметр
//  ИдентификаторСтроки - Число, СтрокаТаблицыЗначений, Неопределено, Произвольный - Идентификатор строки в таблице
// 
// Возвращаемое значение:
//  Структура:
// * Параметр - см. НовыйПараметр 
// * ИдентификаторСтроки - Число, СтрокаТаблицыЗначений, Неопределено, Произвольный - 
// * Идентификатор - Строка - имя параметра или имя параметра таблицы + идентификатор строки в формате %1[%2]
// * ИсходноеЗначение - Неопределено - сохраненное значение параметра перед изменением
// * Значение - Неопределено - новое значение параметра
Функция НовыйРасчетныйПараметр(МодельОбъекта, Параметр, Знач ИдентификаторСтроки = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Параметр.ПараметрТаблица) Тогда
		Если ИдентификаторСтроки = Неопределено Тогда
			ИдентификаторСтроки = ПолучитьЗначениеПараметра(МодельОбъекта, Параметр.ПараметрТаблица.ПараметрТекущаяСтрока);
		КонецЕсли;
		Идентификатор = СтрШаблон("%1[%2]", Параметр.Имя, ИдентификаторСтроки);
	Иначе
		Идентификатор = Параметр.Имя;
	КонецЕсли;
	РасчетныйПараметр = Новый Структура;
	РасчетныйПараметр.Вставить("Параметр", Параметр);
	РасчетныйПараметр.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	РасчетныйПараметр.Вставить("Идентификатор", Идентификатор);
	РасчетныйПараметр.Вставить("ИсходноеЗначение", Неопределено);
	РасчетныйПараметр.Вставить("Значение", Неопределено);
	Возврат РасчетныйПараметр;
КонецФункции

// Новое состояние расчета.
// 
// Возвращаемое значение:
//  Структура - Новое состояние расчета:
// * Очередь - Массив из см. НовыйРасчетныйПараметр - приоритетная очередь расчетных параметров
// * РассчитанныеПараметры - Массив из см. НовыйРасчетныйПараметр - 
// * СловарьПараметрыВОчереди - Соответствие из Строка - идентификаторы расчетных параметров из очереди:
//  ** Ключ - Строка - идентификатор расчетного параметра
//  ** Значение - Булево - есть/нет
// * СловарьРассчитанныеПараметры - Соответствие из Строка - идентификаторы расчетных параметров, которые уже были рассчитаны: 
//  ** Ключ - Строка - идентификатор расчетного параметра
//  ** Значение - Булево - есть/нет
// * Статус - Булево - Истина - расчет завершен успешно, Ложь - расчет прерван
Функция НовоеСостояниеРасчета() Экспорт
	Состояние = Новый Структура;
	Состояние.Вставить("Очередь", Новый Массив);
	Состояние.Вставить("СловарьПараметрыВОчереди", Новый Соответствие);
	Состояние.Вставить("СловарьРассчитанныеПараметры", Новый Соответствие);
	Состояние.Вставить("РассчитанныеПараметры", Новый Массив);
	Состояние.Вставить("Статус", Ложь);
	Возврат Состояние;
КонецФункции

// ПолучитьПараметрИзИдентификатора
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
//  Идентификатор - Строка - 
// 
// Возвращаемое Значение:
//  см. НовыйРасчетныйПараметр
Функция ПолучитьПараметрИзИдентификатора(МодельОбъекта, Идентификатор) Экспорт
	Состав = СтрРазделить(Идентификатор, "[]");
	Если Состав.ВГраница() = 0 Тогда
		Возврат НовыйРасчетныйПараметр(МодельОбъекта, МодельОбъекта.ПараметрыСостояния[Идентификатор]);
	Иначе
		Возврат НовыйРасчетныйПараметр(МодельОбъекта, МодельОбъекта.ПараметрыСостояния[Состав[0]], Число(Состав[1]));
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Расчет

// Получить текущий идентификатор строки.
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
//  ПараметрТаблица - см. РаботаСМодельюСостояния.НовыйПараметр
// 
// Возвращаемое значение:
//  Число - индекс текущей строки
Функция ПолучитьТекущийИдентификаторСтроки(МодельОбъекта, ПараметрТаблица) Экспорт
	
	Таблица = ПолучитьЗначениеПараметра(МодельОбъекта, ПараметрТаблица);
	ТекущаяСтрока = ПолучитьЗначениеПараметра(МодельОбъекта, ПараметрТаблица.ПараметрТекущаяСтрока);
	
	Если ТекущаяСтрока = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Для Таблицы %1 Не Определена Текущая Строка %2", ПараметрТаблица.Имя, ПараметрТаблица.ПараметрТекущаяСтрока.Имя);
	КонецЕсли;
	
	Возврат Таблица.Индекс(Таблица.НайтиПоИдентификатору(ТекущаяСтрока));
	
КонецФункции

// При изменении параметра.
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта 
//  РасчетныйПараметрИлиИмя - Строка, Структура - см. НовыйРасчетныйПараметр
//  ИдентификаторСтроки - Неопределено - Идентификатор строки
Процедура ПриИзмененииПараметра(МодельОбъекта, РасчетныйПараметрИлиИмя, ИдентификаторСтроки = Неопределено) Экспорт
	
	Если ТипЗнч(РасчетныйПараметрИлиИмя) = Тип("Строка") Тогда
		ПараметрСостояния = МодельОбъекта.ПараметрыСостояния[РасчетныйПараметрИлиИмя];
		Если ПараметрСостояния = Неопределено Тогда
			Возврат;
		КонецЕсли;
		РасчетныйПараметр = НовыйРасчетныйПараметр(МодельОбъекта, ПараметрСостояния, ИдентификаторСтроки);
	Иначе
		РасчетныйПараметр = РасчетныйПараметрИлиИмя;
	КонецЕсли;
	
	МодельОбъекта.ИзмененныеПараметры.Добавить(РасчетныйПараметр);
	
КонецПроцедуры

// Добавить параметр в очередь обработки расчета. Если параметр уже был добавлен ранее, то ничего не делается
// 
// Параметры:
//  СостояниеРасчета - см. НовоеСостояниеРасчета
//  РасчетныйПараметр - см. НовыйРасчетныйПараметр
// 
// Возвращаемое значение:
//  Булево - Истина, когда параметр был добавлен в очередь, иначе Ложь
Функция ДобавитьПараметрВОчередь(СостояниеРасчета, РасчетныйПараметр) Экспорт
	СловарьПараметрыВОчереди = СостояниеРасчета.СловарьПараметрыВОчереди;
	Если СловарьПараметрыВОчереди[РасчетныйПараметр.Идентификатор] = Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	СловарьПараметрыВОчереди[РасчетныйПараметр.Идентификатор] = Истина;
	РаботаСМассивом.ПоложитьВОчередьСПриоритетом(СостояниеРасчета.Очередь, РасчетныйПараметр, "Сравнить(Б.Параметр.Порядок, А.Параметр.Порядок)");
	Возврат Истина;	
КонецФункции

// Рассчитать.
// 
// Параметры:
//  Контекст - ОбъектМетаданных
//  ВходящиеПараметры - Массив из см. НовыйРасчетныйПараметр
//  СостояниеРасчета - Неопределено, Структура - см. НовоеСостояниеРасчета
// 
// Возвращаемое значение:
//  см. НовоеСостояниеРасчета
//@skip-check constructor-function-return-section
Функция Рассчитать(Контекст, ВходящиеПараметры = Неопределено, СостояниеРасчета = Неопределено) Экспорт
	
	МодельОбъекта = НоваяМодельОбъекта(Контекст);
	ИзмененныеПараметры = МодельОбъекта.ИзмененныеПараметры;
	
	//  Инициализация состояния
	Если НЕ ЗначениеЗаполнено(СостояниеРасчета) Тогда
		СостояниеРасчета = НовоеСостояниеРасчета();
		Если ВходящиеПараметры = Неопределено Тогда
			Для Каждого ЭлементПараметра Из МодельОбъекта.ПараметрыСостояния Цикл
				ПараметрСостояния = ЭлементПараметра.Значение;
				Если НЕ ПараметрСостояния.Контекстный ИЛИ ЗначениеЗаполнено(ПараметрСостояния.ПараметрТаблица) Тогда
					Продолжить;
				КонецЕсли;
				РасчетныйПараметр = НовыйРасчетныйПараметр(МодельОбъекта, ПараметрСостояния);
				ДобавитьПараметрВОчередь(СостояниеРасчета, РасчетныйПараметр);				
			КонецЦикла;
		ИначеЕсли ТипЗнч(ВходящиеПараметры) = Тип("Строка") Тогда
			Для Каждого Идентификатор Из ОбщийКлиентСервер.Массив(ВходящиеПараметры) Цикл
				РасчетныйПараметр = ПолучитьПараметрИзИдентификатора(МодельОбъекта, Идентификатор);
				ИзмененныеПараметры.Добавить(РасчетныйПараметр);
			КонецЦикла;
		Иначе
			ИзмененныеПараметры = РаботаСМассивом.Дополнить(ИзмененныеПараметры, ВходящиеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	//  Цикл расчета
	Очередь = СостояниеРасчета.Очередь;

	Пока ЗначениеЗаполнено(ИзмененныеПараметры) ИЛИ ЗначениеЗаполнено(Очередь) Цикл
		
		//  Формировании очереди
		Для Каждого РасчетныйПараметр Из ИзмененныеПараметры Цикл
			ДобавитьПараметрВОчередь(СостояниеРасчета, РасчетныйПараметр);
			ДобавитьПараметрВРассчитанные(СостояниеРасчета, РасчетныйПараметр);
			ЗависимыеПараметры = ПолучитьЗависимыеПараметры(МодельОбъекта, РасчетныйПараметр);
			Для Каждого ЗависимыйПараметр Из ЗависимыеПараметры Цикл
				ДобавитьПараметрВОчередь(СостояниеРасчета, ЗависимыйПараметр);
				УдалитьПараметрИзРассчитанных(СостояниеРасчета, ЗависимыйПараметр);
			КонецЦикла;
		КонецЦикла;
		
		//  Расчет
		РасчетныйПараметр = РаботаСМассивом.Последний(Очередь);
		
		Если НЕ ЗначениеЗаполнено(РасчетныйПараметр) Тогда
			СостояниеРасчета.Статус = Истина;
			Возврат СостояниеРасчета;
		КонецЕсли;
		
		#Если Клиент Тогда
			Если НЕ РасчетныйПараметр.Параметр.НаКлиенте Тогда
				Возврат СостояниеРасчета;
			КонецЕсли;		
		#КонецЕсли
		
		ИзмененныеПараметры.Очистить();
		
		Если ПараметрРассчитан(СостояниеРасчета, РасчетныйПараметр) Тогда
			
			РаботаСМассивом.Взять(Очередь);
			//  Проверка значения
			Если РасчетныйПараметр.Параметр.ПроверкаЗначения Тогда
				Отказ = Ложь;
				ПараметрыВыбора = ПолучитьВходящиеПараметры(МодельОбъекта, РасчетныйПараметр, Отказ);
				Если Отказ Тогда
					// оставим заполнение параметра "как есть"
					ИзмененныеПараметры.Добавить(РасчетныйПараметр);
					Продолжить;
				КонецЕсли;
				// проверим правильность заполнения через обработчик
				ИмяРеквизита = Неопределено;//  Используется для получения псевдонима ссылки
				Если ОбработчикЗаполнения(МодельОбъекта, РасчетныйПараметр, ОбъектПараметра(МодельОбъекта, РасчетныйПараметр, ИмяРеквизита)[ИмяРеквизита], ПараметрыВыбора) Тогда
					// Значение изменилось, значит либо оно сброшено, либо приведено в новое дефолтное значение
					ИзмененныеПараметры.Добавить(РасчетныйПараметр);
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			Если ПризнакИспользования(МодельОбъекта, РасчетныйПараметр) Тогда
				ОбработчикПриИзменении(МодельОбъекта, РасчетныйПараметр, ИзмененныеПараметры);
			КонецЕсли;
			
		ИначеЕсли ПризнакИспользования(МодельОбъекта, РасчетныйПараметр) Тогда
			
			Если РасчетныйПараметр.Параметр.Вычисляемый Тогда
				
				// поскольку значение не хранится, то считается измененным всегда
				ИзмененныеПараметры.Добавить(РасчетныйПараметр);
				
			Иначе
				
				Отказ = Ложь;
				ПараметрыВыбора = ПолучитьВходящиеПараметры(МодельОбъекта, РасчетныйПараметр, Отказ);
				
				Если Отказ Тогда
					РаботаСМассивом.Взять(Очередь);
					Продолжить;
				КонецЕсли;
				
				ИмяРеквизита = Неопределено;
				Если ОбработчикЗаполнения(МодельОбъекта, РасчетныйПараметр, ОбъектПараметра(МодельОбъекта, РасчетныйПараметр, ИмяРеквизита)[ИмяРеквизита], ПараметрыВыбора) Тогда
					ИзмененныеПараметры.Добавить(РасчетныйПараметр);
				Иначе
					РаботаСМассивом.Взять(Очередь);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе 
			
			// параметр не используется и будет очищен
			РаботаСМассивом.Взять(Очередь);
			Если ОчиститьЗначение(МодельОбъекта, РасчетныйПараметр) Тогда
				ИзмененныеПараметры.Добавить(РасчетныйПараметр);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СостояниеРасчета.Статус = Истина;
	Возврат СостояниеРасчета;
	
КонецФункции

// Рассчитать параметры, которые являются контекстными (не объектными, т.е. не хранятся в объекте и являются вспомогательными) либо вычисляемые (не хранятся нигде)
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
Процедура РассчитатьПараметрыКонтекста(МодельОбъекта) Экспорт
	РасчетныеПараметры = Новый Массив;
	Для Каждого ЭлементПараметра Из МодельОбъекта.ПараметрыСостояния Цикл
		ПараметрСостояния = ЭлементПараметра.Значение;
		Если НЕ ПараметрСостояния.Контекстный ИЛИ ПараметрСостояния.Вычисляемый Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрСостояния.ПараметрТаблица) Тогда
			Таблица = ПолучитьЗначениеПараметра(МодельОбъекта, ПараметрСостояния.ПараметрТаблица);
			#Если Клиент Тогда
				Если Строка(Таблица) = "ДанныеФормыДерево" Тогда
					
				Иначе  
					Для Каждого ЭлементСтроки Из Таблица Цикл
						ИдентификаторСтроки = ?(МодельОбъекта.ЭтоКонтекстФормы, ЭлементСтроки.ПолучитьИдентификатор(), Таблица.Индекс(ЭлементСтроки));
						РасчетныйПараметр = НовыйРасчетныйПараметр(МодельОбъекта, ПараметрСостояния, ИдентификаторСтроки);
						РасчетныеПараметры.Добавить(РасчетныйПараметр);
					КонецЦикла;
				КонецЕсли;
			#Иначе
				Если ТипЗнч(Таблица) = Тип("ДеревоЗначений") ИЛИ ТипЗнч(Таблица) = Тип("ДанныеФормыДерево") Тогда
					
				Иначе  
					Для Каждого ЭлементСтроки Из Таблица Цикл
						ИдентификаторСтроки = ?(МодельОбъекта.ЭтоКонтекстФормы, ЭлементСтроки.ПолучитьИдентификатор(), Таблица.Индекс(ЭлементСтроки));
						РасчетныйПараметр = НовыйРасчетныйПараметр(МодельОбъекта, ПараметрСостояния, ИдентификаторСтроки);
						РасчетныеПараметры.Добавить(РасчетныйПараметр);
					КонецЦикла;
				КонецЕсли;
			#КонецЕсли
				
			Продолжить;
		КонецЕсли;
		РасчетныйПараметр = НовыйРасчетныйПараметр(МодельОбъекта, ПараметрСостояния);
		РасчетныеПараметры.Добавить(РасчетныйПараметр);
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(РасчетныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	РаботаСМассивом.Сортировать(РасчетныеПараметры, "Сравнить(А.Параметр.Порядок, Б.Параметр.Порядок)");
	Для Каждого РасчетныйПараметр Из РасчетныеПараметры Цикл 
		Отказ = Ложь;
		Параметры = ПолучитьВходящиеПараметры(МодельОбъекта, РасчетныйПараметр, Отказ);
		Если Отказ Тогда
			ОчиститьЗначение(МодельОбъекта, РасчетныйПараметр);
			Продолжить;
		КонецЕсли;
		ИмяРеквизита = Неопределено;// Данная Переменная Определяется В Функции ПолучитьРеквизитФормыПоПути
		ОбработчикЗаполнения(МодельОбъекта, РасчетныйПараметр, ОбъектПараметра(МодельОбъекта, РасчетныйПараметр, ИмяРеквизита)[ИмяРеквизита], Параметры);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПараметрСостояния

Функция ПризнакИспользованияПараметра(МодельОбъекта, Параметр, ИдентификаторСтроки = Неопределено) Экспорт
	Возврат ЗначениеСвойстваПараметра(МодельОбъекта, Параметр, ИдентификаторСтроки, "Использование");
КонецФункции

Функция УстановитьЗначениеПараметра(МодельОбъекта, Параметр, Значение, ИдентификаторСтроки = Неопределено) Экспорт
	РасчетныйПараметр = НовыйРасчетныйПараметр(МодельОбъекта, Параметр, ИдентификаторСтроки);
	Возврат УстановитьЗначение(МодельОбъекта, РасчетныйПараметр, Значение);
КонецФункции

Функция ПолучитьЗначениеПараметра(МодельОбъекта, Параметр, ИдентификаторСтроки = Неопределено) Экспорт
	РасчетныйПараметр = НовыйРасчетныйПараметр(МодельОбъекта, Параметр, ИдентификаторСтроки);
	Возврат ПолучитьЗначение(МодельОбъекта, РасчетныйПараметр);
КонецФункции

Функция ЗначениеСвойстваПараметра(МодельОбъекта, Параметр, ИдентификаторСтроки = Неопределено, ИмяСвойства) Экспорт
	ПараметрСвойства = Параметр["Параметр" + ИмяСвойства];
	Если ЗначениеЗаполнено(ПараметрСвойства) Тогда
		Возврат ПолучитьЗначениеПараметра(МодельОбъекта, ПараметрСвойства, ИдентификаторСтроки);
	КонецЕсли;
	Если ИмяСвойства = "Использование" Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Параметр[ИмяСвойства];
КонецФункции

#КонецОбласти

#Область РасчетныйПараметр

Функция ПризнакИспользования(МодельОбъекта, РасчетныйПараметр) Экспорт
	Возврат ЗначениеСвойства(МодельОбъекта, РасчетныйПараметр, "Использование");
КонецФункции

Функция УстановитьЗначение(МодельОбъекта, РасчетныйПараметр, Значение) Экспорт
	ИмяРеквизита = Неопределено;
	Возврат УстановитьЗначениеПоСсылке(ОбъектПараметра(МодельОбъекта, РасчетныйПараметр, ИмяРеквизита)[ИмяРеквизита], Значение, РасчетныйПараметр);
КонецФункции

// Получить значение.
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
//  РасчетныйПараметр - см. НовыйРасчетныйПараметр
// 
// Возвращаемое значение:
//  Произвольный
//@skip-check module-unused-local-variable
Функция ПолучитьЗначение(МодельОбъекта, РасчетныйПараметр) Экспорт
	Контекст = МодельОбъекта.Контекст;
	Если РасчетныйПараметр.Параметр.Вычисляемый Тогда
		Отказ = Ложь;
		Параметры = ПолучитьВходящиеПараметры(МодельОбъекта, РасчетныйПараметр, Отказ);
		Если Отказ Тогда
			Тип = РасчетныйПараметр.Параметр.Тип;
			Если ЗначениеЗаполнено(Тип) Тогда
				Возврат Тип.ПривестиЗначение(Неопределено);
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		Попытка
			//@skip-check server-execution-safe-mode
			Значение = Вычислить(РасчетныйПараметр.Параметр.Выражение);
		Исключение
			ВызватьИсключение СтрШаблон("Ошибка вычисления параметра %1: %2", РасчетныйПараметр.Параметр.Имя, РасчетныйПараметр.Параметр.Выражение);
		КонецПопытки;
		Возврат Значение;
	КонецЕсли;
	ИмяРеквизита = Неопределено;
	Возврат ОбъектПараметра(МодельОбъекта, РасчетныйПараметр, ИмяРеквизита)[ИмяРеквизита];
КонецФункции

Функция ЗначениеСвойства(МодельОбъекта, РасчетныйПараметр, ИмяСвойства) Экспорт
	Возврат ЗначениеСвойстваПараметра(МодельОбъекта, РасчетныйПараметр.Параметр, РасчетныйПараметр.ИдентификаторСтроки, ИмяСвойства) ;
КонецФункции

#КонецОбласти

#Область Заполнение

Функция ЗаполнитьОбъект(МодельОбъекта, Шаблон) Экспорт
	Перем ИдентификаторСтроки;
	
	ЭтоКонтекстФормы = МодельОбъекта.ЭтоКонтекстФормы;
	
	Для Каждого ЭлементШаблона Из Шаблон Цикл
		Параметр = МодельОбъекта.ПараметрыСостояния[ЭлементШаблона.Ключ];
		
		Если НЕ ЗначениеЗаполнено(Параметр) Тогда
			ВызватьИсключение СтрШаблон("Параметр %1 неопределен", ЭлементШаблона.Ключ);
		КонецЕсли;
		
		Если Параметр.ЭтоТаблица Тогда
			
			Если НЕ ЗначениеЗаполнено(ЭлементШаблона.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПерваяСтрока = Истина;
			РежимЗаполнения = Ложь;
			Таблица = ПолучитьЗначениеПараметра(МодельОбъекта, Параметр);
			Для Каждого ЭлементСтроки Из ЭлементШаблона.Значение Цикл
				ЭлементСтроки.Свойство("ИдентификаторСтроки", ИдентификаторСтроки);
				
				Если ЭтоПерваяСтрока Тогда
					ЭтоПерваяСтрока = Ложь;
					Если ИдентификаторСтроки = Неопределено Тогда
						РежимЗаполнения = Истина;
						Таблица.Очистить();						
					КонецЕсли;
				КонецЕсли;
				
				Если РежимЗаполнения Тогда
					ЭлементСтрокиТаблицы = Таблица.Добавить();
					ИдентификаторСтроки = ?(ЭтоКонтекстФормы, ЭлементСтрокиТаблицы.ПолучитьИдентификатор(), Таблица.Индекс(ЭлементСтрокиТаблицы));
				Иначе  
					ЭлементСтрокиТаблицы = ?(ЭтоКонтекстФормы, Таблица.НайтиПоИдентификатору(ИдентификаторСтроки), Таблица[ИдентификаторСтроки]);
				КонецЕсли;
				
				Для Каждого ЭлементПоля Из ЭлементСтроки Цикл
					Если ЭлементПоля.Ключ = "ИдентификаторСтроки" Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ ОбщийКлиентСервер.УстановитьЗначение(ЭлементСтрокиТаблицы[ЭлементПоля.Ключ], ЭлементПоля.Значение) Тогда
						Продолжить;
					КонецЕсли;
					ИмяПараметра = ЭлементШаблона.Ключ + "." + ЭлементПоля.Ключ;
					ПриИзмененииПараметра(МодельОбъекта, ИмяПараметра, ИдентификаторСтроки);
				КонецЦикла;
			КонецЦикла;
			ПриИзмененииПараметра(МодельОбъекта, ЭлементШаблона.Ключ);
		Иначе
			Если УстановитьЗначениеПараметра(МодельОбъекта, Параметр, ЭлементШаблона.Значение) Тогда
				ПриИзмененииПараметра(МодельОбъекта, ЭлементШаблона.Ключ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МодельОбъекта.ИзмененныеПараметры;
	
КонецФункции

Функция Заполнить(Контекст, Шаблон) Экспорт
	
	МодельОбъекта = НоваяМодельОбъекта(Контекст);
	ЗаполнитьОбъект(МодельОбъекта, Шаблон);
	Возврат МодельОбъекта.ИзмененныеПараметры;
	
КонецФункции

#КонецОбласти

// ПутьКДанным
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
//  Параметр - Структура - см. НовыйПараметрСостояния
// 
// Возвращаемое Значение:
//  Строка
Функция ПутьКДанным(МодельОбъекта, Параметр) Экспорт
	Если НЕ Параметр.Контекстный Тогда
		Возврат ?(ЗначениеЗаполнено(МодельОбъекта.ПутьКДаннымОбъекта), МодельОбъекта.ПутьКДаннымОбъекта + ".", "") + Параметр.ПутьКДанным;
	Иначе
		Возврат Параметр.ПутьКДанным;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути
// В этой версии добавлена исходящая переменная ИмяРеквизита. Это необходимо для Получения Ссылки на Значение.
// 
// Параметры:
//  Контекст - ОбъектМетаданных
//  ПутьКДанным - Строка -
//  ИмяРеквизита - Строка - последний элемент пути к данным
// 
// Возвращаемое значение:
//  Произвольный
Функция ПолучитьРеквизитПоПути(Контекст, ПутьКДанным, ИмяРеквизита = "")
	ПутьКДаннымОбъекта = Лев(ПутьКДанным, СтрНайти(ПутьКДанным, ".", НаправлениеПоиска.СКонца)-1);
	Если ЗначениеЗаполнено(ПутьКДаннымОбъекта) Тогда
		ИмяРеквизита = ОбщийКлиентСервер.ОкончаниеСтрокиПослеРазделителя(путьКДанным);
		Возврат ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Контекст, ПутьКДаннымОбъекта);
	Иначе
		ИмяРеквизита = ПутьКДанным;
		Возврат Контекст;
	КонецЕсли;
КонецФункции

// Возвращает значение расчетного параметра модели объекта: реквизит по пути к данным,
// строку табличного реквизита формы или значение параметра из хранилища знечений модели.
//
// Параметры:
//   МодельОбъекта - см. НоваяМодельОбъекта
//   РасчетныйПараметр - см. НовыйРасчетныйПараметр
//   ИмяРеквизита - Строка - имя конечного реквизита для извлечения из значения по пути к данным
//
// Возвращаемое значение:
//   Произвольный - объект, в реквизите которого хранится значение параметра. Доступ к ссылке со значением через обращение по имени реквизита ИмяРеквизита
Функция ОбъектПараметра(МодельОбъекта, РасчетныйПараметр, ИмяРеквизита = "")
	Перем ИдентификаторСтроки;
	ПараметрСостояния = РасчетныйПараметр.Параметр;
	Если ЗначениеЗаполнено(ПараметрСостояния.ПутьКДанным) Тогда
		Контекст = МодельОбъекта.Контекст;
		Если ЗначениеЗаполнено(ПараметрСостояния.ПараметрТаблица) Тогда
			Если НЕ РасчетныйПараметр.Свойство("ИдентификаторСтроки", ИдентификаторСтроки) Тогда
				ВызватьИсключение СтрШаблон("Неопределен идентификатор строки параметра %1", ПараметрСостояния.Имя);
			КонецЕсли;
			ПутьКДаннымТаблицы = ПутьКДанным(МодельОбъекта, ПараметрСостояния.ПараметрТаблица);
			ИмяРеквизита = ОбщийКлиентСервер.ОкончаниеСтрокиПослеРазделителя(ПараметрСостояния.ПутьКДанным);
			Если МодельОбъекта.ЭтоКонтекстФормы Тогда
				Возврат ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Контекст, ПутьКДаннымТаблицы).НайтиПоИдентификатору(РасчетныйПараметр.ИдентификаторСтроки);
			Иначе
				Возврат ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Контекст, ПутьКДаннымТаблицы)[РасчетныйПараметр.ИдентификаторСтроки];
			КонецЕсли;
		Иначе
			Возврат ПолучитьРеквизитПоПути(Контекст, ПутьКДанным(МодельОбъекта, РасчетныйПараметр.Параметр), ИмяРеквизита);
		КонецЕсли;
	Иначе//  значение параметра в хранилище значений модели объекта
		Если ЗначениеЗаполнено(ПараметрСостояния.ПараметрТаблица) Тогда
			ВызватьИсключение СтрШаблон("Не Определено Значение Параметра %1. Табличные Виртуальные Параметры Не Поддерживаются!", ПараметрСостояния.Имя);
		Иначе
			ИмяРеквизита = "значение";
			Возврат МодельОбъекта.ЗначенияПараметров[ПараметрСостояния.ИндексЗначения];
		КонецЕсли;	
	КонецЕсли;
КонецФункции

#Область УстановитьЗначениеПараметра

// Установить значение по ссылке.
// 
// Параметры:
//  СсылкаНаЗначение - Произвольный
//  Значение - Произвольный
//  РасчетныйПараметр - см. НовыйРасчетныйПараметр
// 
// Возвращаемое значение:
//  Булево - значение изменено
Функция УстановитьЗначениеПоСсылке(СсылкаНаЗначение, Значение, РасчетныйПараметр = Неопределено)
	ИсходноеЗначение = СсылкаНаЗначение;
	Если ОбщийКлиентСервер.УстановитьЗначение(СсылкаНаЗначение, Значение, Истина, Истина) Тогда
		Если РасчетныйПараметр <> Неопределено Тогда
			РасчетныйПараметр.ИсходноеЗначение = ИсходноеЗначение;
			РасчетныйПараметр.Значение = Значение;
		КонецЕсли;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Установить пустое значение.
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
//  РасчетныйПараметр - см. НовыйРасчетныйПараметр
//  СсылкаНаЗначение - Произвольный
// 
// Возвращаемое значение:
//  Булево - значение было изменено
Функция УстановитьПустоеЗначениеПоСсылке(МодельОбъекта, РасчетныйПараметр, СсылкаНаЗначение)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЗначение) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(СсылкаНаЗначение) = Тип("ДанныеФормыКоллекция") Тогда
		СсылкаНаЗначение.Очистить();
		Возврат Истина;
	КонецЕсли;
	#Если Сервер Тогда
		Если ТипЗнч(СсылкаНаЗначение) = Тип("ТаблицаЗначений") Тогда
			СсылкаНаЗначение.Очистить();
			Возврат Истина;
		КонецЕсли;
	#КонецЕсли
	
	Тип = РасчетныйПараметр.Параметр.Тип;
	Если ЗначениеЗаполнено(Тип) Тогда
		ПустоеЗначение = Тип.ПривестиЗначение(Неопределено);	
	Иначе
		ПустоеЗначение = Неопределено;
	КонецЕсли;
	
	ОбщийКлиентСервер.УстановитьЗначение(СсылкаНаЗначение, ПустоеЗначение);
	Возврат Истина;
	
КонецФункции

// Установить пустое значение.
// 
// Параметры:
//  МодельОбъекта - см. НоваяМодельОбъекта
//  РасчетныйПараметр - см. НовыйРасчетныйПараметр
// 
// Возвращаемое значение:
//  Булево - значение было изменено
Функция ОчиститьЗначение(МодельОбъекта, РасчетныйПараметр)
	ИмяРеквизита = Неопределено;
	ЗначениеИзменено = УстановитьПустоеЗначениеПоСсылке(МодельОбъекта, РасчетныйПараметр, ОбъектПараметра(МодельОбъекта, РасчетныйПараметр, ИмяРеквизита)[ИмяРеквизита]);
	Возврат ЗначениеИзменено;
КонецФункции

#КонецОбласти

#Область Связи

// Формирует структуру значений входящих параметров расчётного параметра по описанию его связей в модели объекта.
// Дополнительно накапливает параметры с незаполненными значениями, для которых требуется проверка заполнения.
//
// Параметры:
//   МодельОбъекта - см. НоваяМодельОбъекта
//   РасчетныйПараметр - см. НовыйРасчетныйПараметр
//   Отказ - Булево - признак того, что есть обязательные незаполненные параметры
//
// Возвращаемое значение:
//   Структура из Произвольный - значения входящих параметров, расположенные по путям, заданным в связях расчётного параметра:
//     * Ключ - Строка - путь к данным, заданный в связи рекурсивно через вложенные структуры
//     * Значение - Произвольный - значение параметра, соответствующего пути. Может содержать вложенную структуру с элементом пути
Функция ПолучитьВходящиеПараметры(МодельОбъекта, РасчетныйПараметр, Отказ = Ложь)
	
	ПараметрыВыбора = Новый Структура();
	ПараметрСостояния = РасчетныйПараметр.Параметр;
	ИдентификаторСтроки = РасчетныйПараметр.ИдентификаторСтроки;
	
	Для Каждого ИдентификаторСвязи Из ПараметрСостояния.ВходящиеСвязи Цикл
		Связь = МодельОбъекта.Связи[ИдентификаторСвязи];
		Если НЕ ЗначениеЗаполнено(Связь.ПутьКДанным) Тогда
			Продолжить;
		КонецЕсли;   
		ИспользованиеСвязи = НЕ ЗначениеЗаполнено(Связь.ПараметрИспользование) ИЛИ ПризнакИспользованияПараметра(МодельОбъекта, Связь.ПараметрИспользование, ИдентификаторСтроки);
		Если НЕ ИспользованиеСвязи Тогда
			Продолжить;
		КонецЕсли;   
		Параметр = Связь.Параметр;
		Если ЗначениеЗаполнено(Связь.ПараметрИспользование) И НЕ ПолучитьЗначениеПараметра(МодельОбъекта, Связь.ПараметрИспользование) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Параметр) Тогда
			ЗначениеПараметра = Связь.Значение;
		ИначеЕсли НЕ ПризнакИспользованияПараметра(МодельОбъекта, Параметр, ИдентификаторСтроки) Тогда
			Продолжить;
		Иначе
			ЗначениеПараметра = ПолучитьЗначениеПараметра(МодельОбъекта, Связь.Параметр, ИдентификаторСтроки);
			Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) 
				И ЗначениеСвойстваПараметра(МодельОбъекта, Связь.Параметр, ИдентификаторСтроки, "ПроверкаЗаполнения")
				И (Связь.ПроверкаЗаполнения = Неопределено ИЛИ Связь.ПроверкаЗаполнения) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		ОбщийКлиентСервер.ВставитьСвойствоРекурсивно(ПараметрыВыбора, Связь.ПутьКДанным, ЗначениеПараметра);
	КонецЦикла;
	
	Возврат ПараметрыВыбора;
	
КонецФункции

// Вычисляет массив зависимых расчетных параметров на основе исходящих связей параметра модели объекта.
//
// Параметры:
//   МодельОбъекта - см. НоваяМодельОбъекта
//   РасчетныйПараметр - см. НовыйРасчетныйПараметр
//
// Возвращаемое значение:
//   Массив из см. НовыйРасчетныйПараметр - массив новых расчетных параметров, зависящих от переданного
Функция ПолучитьЗависимыеПараметры(МодельОбъекта, РасчетныйПараметр)
	ЗависимыеПараметры = Новый Массив;
	Для Каждого ИдентификаторСвязи Из РасчетныйПараметр.Параметр.ИсходящиеСвязи Цикл
		Зависимость = МодельОбъекта.Связи[ИдентификаторСвязи];
		ЗависимыйПараметр = Зависимость.ПараметрСостояния;
		Если ЗначениеЗаполнено(ЗависимыйПараметр.ПараметрТаблица) Тогда
			//  Это Элементы Коллекции
			ПараметрТаблица = ЗависимыйПараметр.ПараметрТаблица;
			Таблица = ПолучитьЗначениеПараметра(МодельОбъекта, ПараметрТаблица);
			Если ЗначениеЗаполнено(ПараметрТаблица.ПараметрОтборСтрок) Тогда
				ОтборСтрок = ПолучитьЗначениеПараметра(МодельОбъекта, ПараметрТаблица.ПараметрОтборСтрок);
				НайденныеСтроки = Таблица.НайтиСтроки(ОтборСтрок);
				Если МодельОбъекта.ЭтоКонтекстФормы Тогда
					Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
						ИдентификаторСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
						ЗависимыеПараметры.Добавить(НовыйРасчетныйПараметр(МодельОбъекта, ЗависимыйПараметр, ИдентификаторСтроки));
					КонецЦикла;
				Иначе
					Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
						ИдентификаторСтроки = Таблица.Индекс(СтрокаТаблицы);
						ЗависимыеПараметры.Добавить(НовыйРасчетныйПараметр(МодельОбъекта, ЗависимыйПараметр, ИдентификаторСтроки));
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(РасчетныйПараметр.Параметр.ПараметрТаблица) И РасчетныйПараметр.Параметр.ПараметрТаблица.Имя = ЗависимыйПараметр.ПараметрТаблица.Имя Тогда
				ЗависимыеПараметры.Добавить(НовыйРасчетныйПараметр(МодельОбъекта, ЗависимыйПараметр, РасчетныйПараметр.ИдентификаторСтроки));
			Иначе
				Если МодельОбъекта.ЭтоКонтекстФормы Тогда
					Для Каждого ЭлементКоллекции Из Таблица Цикл
						ЗависимыеПараметры.Добавить(НовыйРасчетныйПараметр(МодельОбъекта, ЗависимыйПараметр, ЭлементКоллекции.ПолучитьИдентификатор()));
					КонецЦикла;
				Иначе
					Для ИдентификаторСтроки = 0 По Таблица.Количество() - 1 Цикл
						ЗависимыеПараметры.Добавить(НовыйРасчетныйПараметр(МодельОбъекта, ЗависимыйПараметр, ИдентификаторСтроки));
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗависимыеПараметры.Добавить(НовыйРасчетныйПараметр(МодельОбъекта, ЗависимыйПараметр));					
		КонецЕсли;
	КонецЦикла;
	Возврат ЗависимыеПараметры;
КонецФункции

#КонецОбласти

#Область Обработчики

//@skip-check module-unused-local-variable
Функция ОбработчикЗаполнения(МодельОбъекта, РасчетныйПараметр, СсылкаНаЗначение, Параметры)
	Контекст = МодельОбъекта.Контекст;
	Значение = СсылкаНаЗначение;
	ПараметрСостояния = РасчетныйПараметр.Параметр;
	Отказ = Ложь;
	СтандартнаяОбработка = Истина;
	Если ЗначениеЗаполнено(ПараметрСостояния.Выражение) Тогда
		Попытка
			//@skip-check server-execution-safe-mode
			Значение = Вычислить(ПараметрСостояния.Выражение);
		Исключение
			ВызватьИсключение "Ошибка расчета параметра " + РасчетныйПараметр.Идентификатор + Символы.ПС + ОписаниеОшибки();
		КонецПопытки
	Иначе
		#Если Сервер Тогда		
			Если СтандартнаяОбработка И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(СсылкаНаЗначение)) Тогда
				ЗаполнятьПоУмолчанию = ЗначениеСвойства(МодельОбъекта, РасчетныйПараметр, "ЗаполнениеПоУмолчанию"); 
				Значение = РаботаСМодельюОбъекта.ПолучитьЗначениеСсылочногоТипа(СсылкаНаЗначение, Параметры, ЗаполнятьПоУмолчанию, Отказ); 
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрСостояния.Тип) Тогда
		Значение = ПараметрСостояния.Тип.ПривестиЗначение(Значение);
	КонецЕсли;
	РасчетныйПараметр.Вставить("ИсходноеЗначение", СсылкаНаЗначение);
	РасчетныйПараметр.Вставить("Значение", Значение);
	Возврат ОбщийКлиентСервер.УстановитьЗначение(СсылкаНаЗначение, Значение, Истина, Истина);
КонецФункции

//@skip-check module-unused-local-variable
Функция ОбработчикПриИзменении(МодельОбъекта, РасчетныйПараметр, ИзмененныеПараметры)
	МодельОбъекта.ИзмененныеПараметры = ИзмененныеПараметры;
	Контекст = МодельОбъекта.Контекст;
	ПараметрСостояния = РасчетныйПараметр.Параметр;
	ОбработчикПриИзменении = ПараметрСостояния.ОбработчикПриИзменении;
	Если НЕ ЗначениеЗаполнено(ОбработчикПриИзменении) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		//@skip-check server-execution-safe-mode
		Возврат Вычислить(ОбработчикПриИзменении);
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
КонецФункции

#КонецОбласти

#Область СостояниеРасчета

Процедура ДобавитьПараметрВРассчитанные(СостояниеРасчета, РасчетныйПараметр)
	СостояниеРасчета.СловарьРассчитанныеПараметры[РасчетныйПараметр.Идентификатор] = Истина;
	СостояниеРасчета.РассчитанныеПараметры.Добавить(РасчетныйПараметр); 	
КонецПроцедуры

Процедура УдалитьПараметрИзРассчитанных(СостояниеРасчета, РасчетныйПараметр)
	СостояниеРасчета.СловарьРассчитанныеПараметры[РасчетныйПараметр.Идентификатор] = Неопределено;
КонецПроцедуры

Функция ПараметрРассчитан(СостояниеРасчета, РасчетныйПараметр)
	Возврат СостояниеРасчета.СловарьРассчитанныеПараметры[РасчетныйПараметр.Идентификатор] = Истина;
КонецФункции

#КонецОбласти

#КонецОбласти
