//@skip-check object-module-export-variable

#Область ОписаниеПеременных

Перем Схема Экспорт;// см. РаботаСМодельюСостояния.НоваяСхема
Перем ПараметрСостояния Экспорт;// см. РаботаСМодельюСостояния.НовыйПараметрСостояния
Перем Связь Экспорт;// см. РаботаСМодельюСостояния.НоваяСвязь
Перем ЭлементФормы Экспорт;// см. РаботаСМодельюСостояния.НовыйЭлементФормы
Перем Свойство Экспорт;// Строка - имя свойства
Перем ПараметрЭлемента Экспорт;// см. РаботаСМодельюСостояния.НовыйПараметрЭлемента
Перем СтекСостояний;// Массив Из см. НовоеСостояние
Перем НаКлиентеПоУмолчанию;// Булево

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область ЭлементыСхемы

// Начальное Состояние Описания. Далее Описываются Связанные Параметры. Описание Завершается Оператором Выражение:
// 	МодельСостояния.ПараметрСостояния()
// 		.Параметр()
// 		.Выражение()
// 	;
// 
// Параметры:
//  ПутьКДанным - Строка - Путь К Данным В Объекте
//  Имя - Строка - Имя Параметра
//  Контекстный - Булево
// 
// Возвращаемое Значение:
//  ОбработкаОбъект.МодельСостояния - Параметр Состояния
Функция ПараметрСостояния(ПутьКДанным = "", Имя = "", Контекстный = Неопределено) Экспорт
	СброситьСостояние();
	ПараметрСостояния = РаботаСМодельюСостояния.ПараметрСостояния(Схема, ПутьКДанным, Имя, Контекстный);
	ПараметрСостояния.НаКлиенте = НаКлиентеПоУмолчанию;
	Возврат ЭтотОбъект;
КонецФункции

// Создает Связь Параметра С Параметром Состояния, Со Свойством Параметра Состояния,
// С Элементом Формы, Со Свойством Элемента Формы.
// Связь С Параметром Состояния Или С Его Свойством Задается Рекурсивно Через Определение Параметра Состояния.
//	МодельСостояния.ПараметрСостояния()
//		.Параметр()
//			.Использование()
//				.Параметр()
//				.Выражение()
//		.Выражение()
//	; 
//	МодельСостояния.ЭлементФормы()
//		.Свойство("Видимость")
//			.Параметр()
//			.Выражение()
//		.Параметр()
//		.ФункцияСостояния()
//	; 
// Параметры:
//  ПутьКДанным - Строка - Путь К Данным Для Использования В Выражении
//  Имя - Строка - Имя Параметра
//  ПроверкаЗаполнения - Булево
// 
// Возвращаемое Значение:
//  ОбработкаОбъект.МодельСостояния
Функция Параметр(ПутьКДанным, Имя = "", ПроверкаЗаполнения = Неопределено) Экспорт
	
	Параметр = РаботаСМодельюСостояния.ПараметрСостояния(Схема, ?(ЗначениеЗаполнено(Имя), Имя, ПутьКДанным));
	
	Если ЗначениеЗаполнено(ПараметрСостояния) Тогда
		Параметр.НаКлиенте = ПараметрСостояния.НаКлиенте;
	ИначеЕсли ЗначениеЗаполнено(ЭлементФормы) Тогда
		Параметр.НаКлиенте = ЭлементФормы.НаКлиенте;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементФормы) И НЕ ЗначениеЗаполнено(Свойство) Тогда
		ПараметрЭлемента = РаботаСМодельюСостояния.ДобавитьПараметрЭлементаФормы(Схема, ЭлементФормы, Параметр, , ПутьКДанным);
		Возврат ЭтотОбъект;
	КонецЕсли;
	Связь = РаботаСМодельюСостояния.ДобавитьСвязь(Схема, ПараметрСостояния, Параметр, ПутьКДанным, , ПроверкаЗаполнения);
	Если ПроверкаЗаполнения = Неопределено Тогда
		Если (ЗначениеЗаполнено(ЭлементФормы) ИЛИ ЗначениеЗаполнено(Свойство)) Тогда
			Связь.ПроверкаЗаполнения = Ложь;
		Иначе
			Связь.ПроверкаЗаполнения = ПараметрСостояния.ПроверкаЗаполнения;
		КонецЕсли;
	КонецЕсли;
	Возврат ЭтотОбъект;
	
КонецФункции

// Элемент формы.
// 
// Параметры:
//  ЭлементИлиИмя - Строка, Произвольный, ФормаКлиентскогоПриложения - Элемент или имя
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельСостояния - Элемент формы
Функция ЭлементФормы(ЭлементИлиИмя = "ЭтаФорма") Экспорт
	СброситьСостояние();
	ЭлементФормы = РаботаСМодельюСостояния.ЭлементФормы(Схема, ЭлементИлиИмя); 
	Возврат ЭтотОбъект;
КонецФункции

// Свойство Элемента Формы, Определяемое Значением Параметра. ИмяПараметраСвойства Свойства Описывается Рекурсивно Как
// ИмяПараметраСвойства Состояния: Определяются Связанные Параметры, Свойства Связей, Выражение. 
//	МодельСостояния.ЭлементФормы()
//		.Свойство("Видимость")
//		...
// 
// Параметры:
//  ИмяСвойства - Строка - Имя Свойства
//  ИмяПараметра - Строка - Имя Параметра
// 
// Возвращаемое Значение:
//  ОбработкаОбъект.МодельСостояния - Свойство
Функция Свойство(ИмяСвойства, ИмяПараметра = "") Экспорт
	Если НЕ ЗначениеЗаполнено(ИмяПараметра) Тогда
		ИмяПараметра = СтрШаблон("%1%2", ЭлементФормы.Имя, ИмяСвойства);
	КонецЕсли;
	СохранитьСостояние("ЭлементФормы");
	Свойство = ИмяСвойства;
	Если ИмяСвойства = "Заголовок" Тогда
		Вычисляемый = Ложь;
	Иначе
		Вычисляемый = Истина;
	КонецЕсли;
	ПараметрСостояния = РаботаСМодельюСостояния.ПараметрСостояния(Схема, ИмяПараметра, , , , Вычисляемый);
	ПараметрСостояния.НаКлиенте = ЭлементФормы.НаКлиенте;
	ПараметрСостояния.ПроверкаЗаполнения = Ложь;
	ПараметрЭлемента = РаботаСМодельюСостояния.ДобавитьПараметрЭлементаФормы(Схема, ЭлементФормы, ПараметрСостояния, ИмяСвойства);
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область СвойстваПараметраСостояния

// Тип булево.
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельСостояния - Тип булево
Функция ТипБулево() Экспорт
	ПараметрСостояния.Тип = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("Булево")));
	ПараметрСостояния.ПроверкаЗаполнения = Ложь;
	Возврат ЭтотОбъект;
КонецФункции

// Проверка значения.
// 
// Параметры:
//  Значение - Булево - Значение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельСостояния - Проверка значения
Функция ПроверкаЗначения(Значение = Истина) Экспорт
	ПараметрСостояния.ПроверкаЗначения = Значение;
	Возврат ЭтотОбъект;
КонецФункции

// Ключ для таблицы, на которую ссылается параметр состояния.
// 
// Параметры:
//  Ключ - Строка - Имена полей через запятую, которые составляют ключ строки таблицы
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельСостояния - Ключ
Функция Ключ(Ключ) Экспорт
	ПараметрСостояния.Ключ = Ключ;
	Возврат ЭтотОбъект;
КонецФункции

// Оператор Выражение Завершает Описание Параметра Состояния, Свойства Параметра Состояния, Свойста Элемента.
// Все Эти Параметры Определяются Параметром Состояния Текущего Стека Состояния.
// 
// Параметры:
//  ТекстВыражения - Строка - Текст Выражения
//  НаКлиенте - Булево -
// 
// Возвращаемое Значение:
//  ОбработкаОбъект.МодельСостояния - Выражение
Функция Выражение(ТекстВыражения = "*") Экспорт
	Если ТекстВыражения = "*" Тогда
		ПараметрСостояния.Выражение = СтрШаблон("%1.ЗначениеПараметра%2(Параметры, Значение, СтандартнаяОбработка, Отказ)", Схема.Модуль, СтрЗаменить(ПараметрСостояния.Имя, ".", ""));
	Иначе
		ПараметрСостояния.Выражение = СтрЗаменить(ТекстВыражения, "'", """");
	КонецЕсли;
	ВосстановитьСостояние();
	Возврат ЭтотОбъект;
КонецФункции

Функция ПараметрПризнака(ИмяПризнака, ИмяПараметра = "") Экспорт
	Перем ПараметрЗадан;
	ИмяПараметраСвойства = ?(ЗначениеЗаполнено(ИмяПараметра), ИмяПараметра, ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору());
	ПараметрИспользование = Схема.ПараметрыСостояния[ИмяПараметраСвойства];
	Если ЗначениеЗаполнено(ПараметрИспользование) Тогда
		ПараметрЗадан = Истина;
	Иначе
		ПараметрЗадан = Ложь;
		ПараметрИспользование = РаботаСМодельюСостояния.ПараметрСостояния(Схема, ИмяПараметраСвойства, , , "Булево");
		ПараметрИспользование.НаКлиенте = НаКлиентеПоУмолчанию;
	КонецЕсли;
	Если ЗначениеЗаполнено(Связь) Тогда
		//  Параметр применяется к связи
		Связь.ПараметрИспользование = ПараметрИспользование;
		Если ПараметрИспользование.ИсходящиеСвязи.Найти(Связь.Идентификатор) = Неопределено Тогда
			ПараметрИспользование.ИсходящиеСвязи.Добавить(Связь.Идентификатор);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрИспользование.ЭлементыСвязей, Связь.ПараметрСостояния.Элементы, Истина);
		//  Переключение на настройку вложенного параметра
		Если ПараметрЗадан Тогда
			Возврат ЭтотОбъект;
		КонецЕсли;			
		СохранитьСостояние();
		ПараметрСостояния = ПараметрИспользование;
		Возврат ЭтотОбъект;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрЭлемента) Тогда
		//  Параметр применяется к параметру к элементу формы
		ПараметрЭлемента.ПараметрИспользование = ПараметрИспользование;
		РаботаСМодельюСостояния.ДобавитьСвязь(Схема, ПараметрЭлемента.Параметр, ПараметрИспользование, ИмяПризнака);// Фиктивная связь с параметром признака Использование
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрИспользование.ЭлементыСвязей, ПараметрЭлемента.Параметр.Элементы, Истина);
		//  Переключение на настройку вложенного параметра
		Если ПараметрЗадан Тогда
			Возврат ЭтотОбъект;
		КонецЕсли;			
		СохранитьСостояние();
		ПараметрСостояния = ПараметрИспользование;
		Возврат ЭтотОбъект;
	КонецЕсли;
	//  Параметр применяется к параметру, возможно рекурсивно (ЭлементФормы-ПараметрЭлемента-ПараметрИспользование)
	ПараметрИспользование.ПараметрТаблица = ПараметрСостояния.ПараметрТаблица;
	Если ЗначениеЗаполнено(ПараметрИспользование.ПараметрТаблица) И НЕ ЗначениеЗаполнено(ПараметрИспользование.ПутьКДанным) Тогда
		ПараметрИспользование.Вычисляемый = Истина;
	КонецЕсли;
	ПараметрСостояния.ПараметрИспользование = ПараметрИспользование;
	РаботаСМодельюСостояния.ДобавитьСвязь(Схема, ПараметрСостояния, ПараметрИспользование);// Фиктивная связь с параметром признака Использование
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрИспользование.ЭлементыСвязей, ПараметрСостояния.Элементы, Истина);
	//  Переключение на настройку вложенного параметра
	Если ПараметрЗадан Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;			
	СохранитьСостояние();
	ПараметрСостояния = ПараметрИспользование;
	Возврат ЭтотОбъект;
КонецФункции

Функция Использование(ИмяПараметра = "") Экспорт
	ПараметрПризнака("Использование", ИмяПараметра);
	Возврат ЭтотОбъект;
КонецФункции

Функция НеИспользование(ИмяПараметра) Экспорт
	Использование();
	Параметр(ИмяПараметра);
	Выражение(СтрШаблон("НЕ Параметры.%1", ИмяПараметра));
	Возврат ЭтотОбъект;
КонецФункции

Функция ПроверкаЗаполнения(ИмяПараметраИлиЗначение = "") Экспорт
	Если ТипЗнч(ИмяПараметраИлиЗначение) = Тип("Булево") Тогда
		Если ЗначениеЗаполнено(Связь) Тогда
			Связь.ПроверкаЗаполнения = ИмяПараметраИлиЗначение;
			Возврат ЭтотОбъект;
		КонецЕсли;	
		ПараметрСостояния.ПроверкаЗаполнения = ИмяПараметраИлиЗначение;
		Возврат ЭтотОбъект;
	КонецЕсли;		
	ПараметрПризнака("ПроверкаЗаполнения", ИмяПараметраИлиЗначение);
	Возврат ЭтотОбъект;
КонецФункции

Функция НеПроверкаЗаполнения(ИмяПараметра) Экспорт
	ПроверкаЗаполнения();
	Параметр(ИмяПараметра);
	Выражение(СтрШаблон("НЕ Параметры.%1", ИмяПараметра));
	Возврат ЭтотОбъект;
КонецФункции

Функция НаКлиенте(Значение = Истина) Экспорт
	НаКлиентеПоУмолчанию = Значение;
	Если ЗначениеЗаполнено(ПараметрСостояния) Тогда
		ПараметрСостояния.НаКлиенте = НаКлиентеПоУмолчанию;
	ИначеЕсли ЗначениеЗаполнено(ЭлементФормы) Тогда
		ЭлементФормы.НаКлиенте = НаКлиентеПоУмолчанию;
	КонецЕсли;
	Возврат ЭтотОбъект;
КонецФункции

Функция НаСервере(Значение = Истина) Экспорт
	НаКлиентеПоУмолчанию = НЕ Значение;
	Если ЗначениеЗаполнено(ПараметрСостояния) Тогда
		ПараметрСостояния.НаКлиенте = НаКлиентеПоУмолчанию;
	ИначеЕсли ЗначениеЗаполнено(ЭлементФормы) Тогда
		ЭлементФормы.НаКлиенте = НаКлиентеПоУмолчанию;
	КонецЕсли;
	Возврат ЭтотОбъект;
КонецФункции

Функция Слабая() Экспорт
	Связь.Слабая = Истина;
	Возврат ЭтотОбъект;
КонецФункции

Функция ТекущаяСтрока(Знач ИмяПараметра = "") Экспорт
	Если НЕ ЗначениеЗаполнено(ЭлементФормы) Тогда
		ВызватьИсключение "Не выбран элемент формы для определения параметра  ТекущаяСтрока";
	КонецЕсли;
	Если ИмяПараметра = "" Тогда
		ИмяПараметра = ЭлементФормы.Имя + ".ТекущаяСтрока";
	КонецЕсли;
	ПараметрТекущаяСтрока = Схема.ПараметрыСостояния[ИмяПараметра];
	Если ЗначениеЗаполнено(ПараметрТекущаяСтрока) Тогда
		ЭлементФормы.ПараметрТекущаяСтрока = ПараметрТекущаяСтрока;
	Иначе
		ЭлементФормы.ПараметрТекущаяСтрока = РаботаСМодельюСостояния.ПараметрСостояния(Схема, , ИмяПараметра);
		ЭлементФормы.ПараметрТекущаяСтрока.НаКлиенте = НаКлиентеПоУмолчанию;
	КонецЕсли;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область РаботаСоСхемой

Функция УстановитьСхему(Контекст, Знач ПутьКДаннымОбъекта = Неопределено, МодульМодели = "Контекст") Экспорт
	Схема = РаботаСМодельюСостояния.НоваяСхема(Контекст, ПутьКДаннымОбъекта, МодульМодели);
	НаКлиентеПоУмолчанию = Ложь;
	Возврат ЭтотОбъект;
КонецФункции

Функция Схема() Экспорт
	Возврат Схема;	
КонецФункции

#КонецОбласти

#Область Обработчики

Функция ПриИзменении(СтрокаВызоваФункции = "*") Экспорт
	Если СтрокаВызоваФункции = "*" Тогда
		ПараметрСостояния.ОбработчикПриИзменении = СтрШаблон("%1.ПриИзмененииПараметра%2(МодельОбъекта, РасчетныйПараметр)", Схема.Модуль, СтрЗаменить(ПараметрСостояния.Имя, ".", ""));
	Иначе
		ПараметрСостояния.ОбработчикПриИзменении = СтрЗаменить(СтрокаВызоваФункции, "'", """");
	КонецЕсли; 
	Возврат ЭтотОбъект;
КонецФункции

Функция ОбработчикИнициализацииДанных() Экспорт
	Схема.ОбработчикИнициализацииДанных = СтрШаблон("%1.ИнициализироватьДанные(Схема)", Схема.Модуль);
	Возврат ЭтотОбъект;
КонецФункции

Функция ФункцияСостояния(СтрокаВызоваФункции = "*") Экспорт
	Если СтрокаВызоваФункции = "*" Тогда
		ЭлементФормы.ФункцияСостояния = СтрШаблон("%1.СвойстваЭлемента%2(Свойства, Параметры)", Схема.Модуль, ЭлементФормы.Имя);
	Иначе
		ЭлементФормы.ФункцияСостояния = СтрЗаменить(СтрокаВызоваФункции, "'", """");
	КонецЕсли;
	ВосстановитьСостояние();
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

Функция ПрименитьМодель() Экспорт
	Контекст = Схема.Контекст;
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		РаботаСМодельюСостояния.ДобавитьЭлементыФормы(Схема);//  Здесь будут добавлены параметры из элементов формы
		ПрименитьМодельОбъекта(Схема);
		РаботаСМодельюФормы.НастроитьПараметрыВыбора(Схема);
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Схема.Объект, "Ссылка") Тогда
			РаботаСМодельюСостояния.УстановитьДействие(Контекст, "ПриЧтенииНаСервере", "ПриЧтенииВМоделиФормыНаСервере");
			РаботаСМодельюСостояния.УстановитьДействие(Контекст, "ПослеЗаписиНаСервере", "ПослеЗаписиВМоделиФормыНаСервере");
		КонецЕсли;
	Иначе
		ПрименитьМодельОбъекта(Схема);
	КонецЕсли;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьМодельОбъекта(Схема)
	Если ЗначениеЗаполнено(Схема.ОбработчикИнициализацииДанных) Тогда
		//@skip-check server-execution-safe-mode
		Выполнить(Схема.ОбработчикИнициализацииДанных);
	КонецЕсли;
	РаботаСМассивом.ОпределитьТопографическийПорядок(Схема.ПараметрыСостояния, "Имя", "ВходящиеСвязи", "Порядок", Схема.Связи, "Параметр");
	РаботаСМодельюОбъектаКлиентСервер.РассчитатьПараметрыКонтекста(Схема);
	РаботаСМодельюСостояния.ПрименитьМодельОбъекта(Схема);
КонецПроцедуры

#Область РаботаССостоянием

Функция НовоеСостояние(Состояние = Неопределено, СписокСвойств = Неопределено)
	//@skip-check structure-consructor-too-many-keys
	НовоеСостояние = Новый Структура("ПараметрСостояния, Связь, ЭлементФормы, Свойство, ПараметрЭлемента");
	Если Состояние <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НовоеСостояние, Состояние, СписокСвойств);
	КонецЕсли;
	Возврат НовоеСостояние;
КонецФункции

Процедура СохранитьСостояние(НаследуемыеСвойства = "")
	ТекущееСостояние = НовоеСостояние(ЭтотОбъект);
	РаботаСМассивом.Добавить(СтекСостояний, ТекущееСостояние);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НовоеСостояние(ЭтотОбъект, НаследуемыеСвойства));
КонецПроцедуры

Процедура ВосстановитьСостояние()
	Состояние = РаботаСМассивом.Взять(СтекСостояний);
	Если Состояние = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Состояние);
КонецПроцедуры

Процедура СброситьСостояние()
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НовоеСостояние());
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Инициализация

СтекСостояний = Новый Массив;
НаКлиентеПоУмолчанию = Ложь;
СброситьСостояние();

#КонецОбласти
