Функция ПолучитьОтборСтрокПараметры(Параметры) Экспорт
	Если Параметры.ТекущаяСтрока = Неопределено ИЛИ НЕ Параметры.Синхронизировать Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДанныеСтроки = Параметры.ПараметрыСостояния.НайтиПоИдентификатору(Параметры.ТекущаяСтрока);
	Отбор = Новый Структура("ИДПараметраСостояния", ДанныеСтроки.ИД);
	Возврат Новый ФиксированнаяСтруктура(Отбор);
КонецФункции

Функция ПолучитьОтборСтрокПараметрыЭлементов(Параметры) Экспорт
	Если Параметры.ТекущаяСтрока = Неопределено ИЛИ НЕ Параметры.Синхронизировать Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДанныеСтроки = Параметры.ЭлементыФормы.НайтиПоИдентификатору(Параметры.ТекущаяСтрока);
	Отбор = Новый Структура("ИДЭлемента", ДанныеСтроки.ИД);
	Возврат Новый ФиксированнаяСтруктура(Отбор);
КонецФункции

Функция ПолучитьСтруктуруСтроки(Параметры) Экспорт
	Если Параметры.ТекущаяСтрока = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДанныеСтроки = Параметры.ПараметрыСостояния.НайтиПоИдентификатору(Параметры.ТекущаяСтрока);
	СтруктураСтроки = Новый Структура("Имя, ПутьКДанным, Выражение, НаКлиенте");
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ДанныеСтроки);
	Возврат СтруктураСтроки;
КонецФункции
